{"review_count":"162","overAllrating":"2.5","aggregated_reviews":[{"reviewer_name":"Joyce R.","rating":5,"date":"2021-03-24","comment":"Update:  Went back to Mathis Bros to order our replacement chair as the leather sample had looked great in our home. Salesman had said it could be here in May & that was fine. Things have been crazy due to Covid. But after meeting up w/ him, guess what? It was in stock! Our chair was waiting for us!! Yea, Mathis Bros."},{"reviewer_name":"Dale C.","rating":1,"date":"2023-02-11","comment":"Bought some furniture and a mirror about a month before they were needed.  Once delivery occurred we started to unpack the mirror and found it was the wrong one.  After several attempts at calling and e-mailing our sales person and the customer service line we never had any resolution or a returned calls.Pathetic customer service, these people do not care about you or your business."},{"reviewer_name":"Jeremiah B.","rating":1,"date":"2023-07-15","comment":"I honestly cannot understand the young manager.  My father is on hospice and is getting weaker by the day.  This morning, my Dad tried to get into his bed, which is tall, and he started to fall and slide off the bed.  I was able to run over and catch him and get him back into bed.  I immediately went online and ordered a king size bunky board set from Mathis Home.  My mom paid for it from my cell phone so I had the sale information on my cell phone.  I drove about an hour to the city to pick up the bunky board set, and the young manager came out and said since my mom paid for it he would not release the furniture unless my mom was there.  I showed him the sale confirmation with my Mom's information.  I showed him my driver's license with the same last name.  I told him my Dad was very sick and on hospice and cannot be left alone and I NEEDED the bunky boards to lower my parent's bed.  He literally told me \"I don't care.  If your mom is not here in person I cannot release the furniture.\"  I told him to get the manager and let me talk to them, and he said, \"I am the highest ranking official on-site.\"  \"Then you can give me the furniture I ordered!\"  I told him we could FaceTime my mom and she could show her license, credit card,  WHATEVER he needed.  Besides I already have ALL of the information on my phone.  He continued to say, \"I hear what you are saying but I don't care about your situation and I will not release the furniture without your mom here in person!\"Absurd!!!  My mom is caring for my dying dad and all he cares about is company policy which could be resolved virtually.  The bed my parents sleep on was bought at Mathis Brother.  The mattress was purchased at Mathis Brothers.  Our kitchen table and 8 chairs, Mathis Brothers.  ALL of our living room furniture....MATHIS BROTHERS.  A set of king size bunky boards, $180, and you treat a customer like this!!!! 30+ years of business from my family and you lost it because of a prideful arrogant young manager that was FLEXING his authority to deny me less that $200 worth of product."},{"reviewer_name":"Shelley W.","rating":1,"date":"2023-04-22","comment":"On 5/22/2022, I ordered two chairs, a loveseat ,a couch, a dining room tabletop and base, 8 chairs and a cabinet along with a furniture protection plan from Mathis Home in Tulsa. On 5/27/2022 the two chairs and loveseat were delivered. The loveseat was damaged. Mathis Home agreed to take the loveseat back and bring a new one when they delivered the sofa. These items were delivered on June 28.  No estimated delivery date on the other pieces. In September I contacted the salesperson and she decided to contact OKC for advice as 4 months had passed. Mathis Home delivered the items on September 27. Attached are photos. The table top had hinges hanging so that the leaf can not be locked. There were various scratches and dents in the table top. The cabinet handles were worn. The cabinet hinges were pulled off. The set was used or demo. They agreed to redeliver. The best part is that when they get the furniture in your home that is when you pay for the furniture. So I have used furniture that I paid new prices for even though they agreed it's bad and they need to replace it. They sent a new set on December 27,2022. The delivery crew was high af. That set was also damaged. The cabinet was caved in on the side. The delivery guys banged the cabinet into the existing table and scratched it. The chairs wobbled. Mathis Home agreed that they would replace the items. The delivery truck swept out nails and screws in my driveway and tracked mud all through my house. They delivers again on March 20, 2023. Damaged again. We just refused the delivery.  Again they delivered on April 10, 2023. Unusable furniture. We refused the delivery. We have a new delivery scheduled for May 8, but the table top has to be brought from California or Ontario. For 6 deliveries, my husband and I have taken off work 6 days. They have offered to give us 15% off if we accept tThe furniture as is. If I wanted used furniture, I would have gone to Facebook Marketplace instead of Mathis Home. Please beware their game and be wary when you purchase from this store.#mathishome #mathisbro"},{"reviewer_name":"Janet R.","rating":1,"date":"2022-09-12","comment":"After 6 months of going back and forth with Kandyce at Mathis Brother's nothing has been done. I just keep getting run around. They agreed that there was extensive damage to the dresser and it arrive with all sorts of putty filler that looks horrible. They can't replace the dresser because the line has been discontinued. They sent someone out to access the damage and he said it was bad but there was nothing he can do to fix it. They offered a 10% refund which is insulting. The bottom line here is they have done nothing and don't even bother to reply to my emails. The drawers are all broken and they said they would repair them, but that was dropped as well. Very, very disappointing for a company this big."},{"reviewer_name":"Genesis G.","rating":1,"date":"2023-05-31","comment":"I bought furniture back in March and it's almost June and I am  still missing a table. If they had told me it was on back order I never would have bought this. It was ALL suppose to be here the first of April. But they reassured me I would have the table in two weeks. Mid April. Never came. Well after one week you can't return your furniture. It would be very hard to find a piece to match. Here it is almost June and I still don't have it. They haven't communicated with me at all. I have to keep calling and asking about it. I will NEVER shop here again. Also, the chairs I got are already fraying. Poor quality. Poor customer service. Poor decision on my part to shop there."},{"reviewer_name":"Laurie K.","rating":1,"date":"2022-06-29","comment":"came into store found chair over 2000,000 ordered and paid for it was to be delivered today almost a month to the day. Chair not is delayed no one bothered to call meat all since purchase of chair no one to update me at anytime.  once they have your money and made a sale they could care less Very poor customer service  Very dissapointed"},{"reviewer_name":"Bert N.","rating":1,"date":"2022-06-03","comment":"Rejecting all my emails to you Mr Stephenson could you please look me up in your stores customer data and call me back I've tried to call you twice  Thank youI've tried again & again no luck with your email sir."},{"reviewer_name":"Sandy C.","rating":1,"date":"2023-06-20","comment":"If anyone is thinking of buying anything from Mathis Home, do yourself a favor and just DON'T.   We ordered two custom chairs in mid February and were told it would be 12-16 weeks, hopefully closer to 12 but say 16 to be safe.  That's a long time, but it was custom so I get it.  That time has passed.  There's still no delivery date but they're \"guessing\"maybe the end of July.  Meanwhile they're now quoting customers a timeline of 12-14 weeks for custom.  No explanation of what the holdup is or where our furniture is or even more than a guess of when we might see it, yet they still have our deposit. No one will even take our phone call or respond to messages.  Don't even THINK about talking to the store manager.  In the meantime we ordered two barstools which they forgot to notify us  came in so we had to track those down.  Then we ordered an end table and coffee table and the \"coffee table\" arrived with only the glass, no base.  Not to worry, though - they could get the base here by SEPTEMBER.  Thankfully our salesman intervened and got them to sell us a floor model.  They have zero customer service and you'd do far better just to drive to Dallas."},{"reviewer_name":"Michelle H.","rating":1,"date":"2023-01-04","comment":"I do not recommend the Tulsa store and the customer service is horrible. And when I call back I just get the runaround and excuses that this person's in Mexico or this person only works on Wednesday that would handle your situation etc. etc. I went in on 10 December picked out some furniture, Purchased it for a later delivery date.  Called the next morning and canceled everything. I had written them at $4900 check which they had said they had already processed and here we are on January 3 and I still don't have my refund. How would you feel if a store had $4900 of your money.???  And I've called several times and no one has helped and no one has resolved this issue and no one seems to care."},{"reviewer_name":"Bill F.","rating":1,"date":"2023-03-28","comment":"I have to completely change my review. This ended up badly. The delivery people showed up with the wrong colored chair. When I told them, they said, \"Oh, just keep it, and we'll get you the right one later. But sign here.\" I'm an attorney, I read everything I sign. It said I was accepting the chair as is. I refused, and they got angry at me in my own home, then took the chair with them. I called my salesman. He promised to fix it, but never did. I called his manager who never returned my call. I called the store and they said to call the sales manager and that the sales manager HAD to call me back. I called over days and he refused to talk to me. When I bugged them enough, one guy told me that they had already tried to deliver my chair but I refused it. I said it was the wrong chair and that I wanted the right one, and he said \"no.\" I asked for a refund and he said \"no.\" They had my money and wouldn't deliver the chair. I finally spoke to a one nice person in OKC, and she refunded the money. I was shocked at how deceptive and unprofessional they were. I felt like I was trying to deal with the mob. Terrible. We have never been back to Mathis Brothers in the years since. I found the same chair (the right color) for a much lower price at North Carolina Furniture in Bixby."},{"reviewer_name":"Sterling J.","rating":1,"date":"2022-10-27","comment":"Of course nobody that I've spoken to seems to prioritize or want customer feedback, but here it is anyway: this company is terrible.The first communication I've received from them since my order in May was an impersonal text informing me that they'll deliver my order this Sunday (in October). I had previously called and was told that the 'concession' they'd make was delivering my order. So to be clear:  to make amends for taking so long, this company is willing to do exactly what I already PAID THEM FOR back in May--and nothing more.I won't be buying from them after this initial experience. I will go out of my way to spend more at other companies if that's what it takes, and I'll tell everybody I can to avoid them."},{"reviewer_name":"Linda H.","rating":1,"date":"2022-06-12","comment":"Went to buy a recliner, found one I liked. They told me the price of delivery was $169, walked out!!!"},{"reviewer_name":"Debra K.","rating":3,"date":"2021-01-02","comment":"So, for the COVID review I would give them five stars.  All customers are temperature screened upon entry and given a paper bracelet to wear.  (But, not sure who was really policing that part.)For furniture selection I give them a three (even though this is the largest furniture store in Tulsa).   I was looking for a funky chair and seriously, everything here was either brown or beige or leather.   Nothing really unique about anything.    There were no galleries as I remember (like Thomasville or other higher end brands).   Brown and beige.  Now I know that they can special ordering anything and they have designers and they can create whatever we want (as the pesky salesperson kept telling us as he followed us around even though we told him we were just browsing).Pretty sure I will stay with some boutique local businesses in the future.  Honestly, I was pretty impressed with Sutherlands (believe it or not)."},{"reviewer_name":"Karly M.","rating":1,"date":"2022-10-13","comment":"My experience with this company was absolutely horrible. I spent thousands of dollars on a brand new dining table and chairs and was told it would arrive at the end of July. After it had been over 2 weeks past the arrival date, I finally called to ask why I hadn't heard anything. They told me that it got delayed the week after I ordered it which was in April and wouldn't be in until September. I was frustrated that after spending so much money, I had to call to find that out after the expected arrival date. I explained that they should have called me immediately to let me know what the new arrival date would be and after many phone calls on my end and no returned calls on their end, they still offered me nothing. One of the last times I tried calling customer service, I was told it wouldn't arrive until November, and again was frustrated because I only found out due to calling about it. They still offered nothing despite how poorly they handled the situation. I eventually got a call from my salesman who told me if I paid in full then they would transfer one from the OKC warehouse. Which was ridiculous but I did it anyway and then again, I had to call to find out it had arrived from OKC and was ready for pickup. To top it all off, when we picked it up, they tried to give me 2 chairs off the floor that were beaten up. When I called to complain they offered to exchange them for 2 new ones. When these chairs arrived, their delivery team ended up putting a massive hole in our wall with one of them. Keep in mind these are not heavy chairs. They are supposedly sending someone to fix it but it is still a huge inconvenience and we have not been offered anything for all the trouble. I will never buy from this company ever again."},{"reviewer_name":"Jeff S.","rating":3,"date":"2021-03-16","comment":"Mathis is probably one of the few places in town with a large enough variety of items to make it worth stopping in.That said, you also have to run the gamut of 'furniture sharks' at the front door.Swear to God, they're worse than used car salesmen.I get my hackles up just pulling into the parking lot. That said, they have gotten better at leaving you alone to shop if you tell them to. Still, they're like a shadow... or an annoying puppy.... not necessarily underfoot, but never far away.As for inventory and price, yeah, they're huge, so they have the most selection and reasonable prices. They must have some value, since we've nearly furnished a house from them over the years."},{"reviewer_name":"Mister M.","rating":1,"date":"2022-09-08","comment":"I did a CPU for two mattresses. Show up the next morning, wait almost an hour to be first in the pickup line. There were 6-7 vehicles behind me, mind you, I'm first there in line. They literally helped everyone else before me!! WTF?!"},{"reviewer_name":"M D.","rating":1,"date":"2022-08-18","comment":"Our sales person was wonderful but customer service is abysmal!  We bought a sectional sofa and warranty.  Almost a year later, we had to file a claim for damage to 2 cushions.  The replacement cushions were shipped to Mathis Brothers instead of my home address.  I live in a different state.  Not one person from Mathis Brothers ever reached out to me about the replacement cushions.  I have called multiple times, explained the situation repeatedly, am told that someone will get back to me, and NO ONE ever does!  I've been dealing with this since August 2021 and still have 2 damaged sofa cushions on my sofa!!!"},{"reviewer_name":"Dana B.","rating":2,"date":"2022-07-23","comment":"The furniture seemed cheap - and the sales people were over the top .  Definitely work commission- so you have someone following you around ."},{"reviewer_name":"Susan O.","rating":5,"date":"2022-08-09","comment":"The quality of furniture at Mathis is always excellent, and their sales staff is attentive and answers my questions. They didn't mind moving things over a little to get everything in the right place. On two different deliveries, the delivery folks noticed that a piece of furniture had a mark and they didn't even bring it in like other places would, but rather they reported it to management while they were at my house. There were plenty of other identical pieces, so they brought another out a couple of days later. This shows a lot of integrity and training."},{"reviewer_name":"Darren P.","rating":3,"date":"2020-05-01","comment":"Furniture is great. During the Covid19 pandemic, some had face-masks, some didn't, and some had face-masks, but had them pulled down under their noses. Might as well not have one on. If you want great furniture from people who don't care if you get a life threatening virus, come to Mathis Bro's. BTW - We bought a king size bed frame and spend about $3k, but it was $1k less expensive than online, and other retailers. I'll update once it's delivered."},{"reviewer_name":"Don H.","rating":1,"date":"2022-07-09","comment":"Been a customer here over 15 years, service has always been adverse at best, floor vultures are over bearing at times. Last year we purchased a love seat and recliner, both electric, also got the battery packs. They claimed the batteries were good for at least 100 cycles. 30-40 is what we're getting. Found out the battery packs were 3 years old when we got them. So we took them back to the request of the service department to exchange for newer packs. They tried to give me wrong one, no go. So they said it's going to be a warranty issue to order in the right ones. So I took pictures of the tags on both pieces of furniture like requested and emailed to the service department like requested. 4 months later and resending the pictures over again still no battery packs. Excuses and excuses is what we get.  Guess I'm going to buy new battery packs online and kick Mathis Brothers to the curb. At least Amazon will send a replacement part in a few day if something goes wrong.     Mathis, your after care sucks, you were more than happy to take my money and forget about me. Well, we're done with you, there's enough competition out there that allows me other choices. So if you're thinking about buying from these guys just remember their service department isn't ran well. Companies failing to deliver quality customer service are at risk of losing not only current customers but also potential ones. Negative word-of-mouth can have a disastrous impact on a company's online reputation causing would-be buyers to look elsewhere."},{"reviewer_name":"Brenda A.","rating":5,"date":"2021-08-23","comment":"As always I had a wonderful experience shopping with Mathis Brothers. I worked again with my AWESOME salesperson Clayton Hale. This visit I used the 12 month interest free offer. I worked with Ricky in customer service and he was helpful and pleasant.I would also like to share the delivery experience. I realize they are 3rd party to Mathis Brothers. But, they are very nice, professional and always respect my home.Thanks again Mathis Brothers,Brenda Aguirre, CDA"},{"reviewer_name":"Addie D.","rating":1,"date":"2021-03-05","comment":"Made a deposit to hold a couch for us in December. Was told it would arrive in mid February. Called late February only for the sales associate to tell me my couch would not be here until LATE APRIL!!!! Nobody called to let me know ANYTHING at all. Waited on hold for a manager for 30 minutes only for the same sales associate to tell me all managers were in a meeting. She took my name and number for a manager to call me back. Never heard anything else."},{"reviewer_name":"Kara R.","rating":1,"date":"2022-05-27","comment":"Around March 2019, we bought an electric recliner chair and about a month before the one-year warranty was set to expire our recliner broke. Around February 2020, we filed a claim with Mathis Brothers, and they sent out a technician to see if the chair could be repaired. The mechanical component to the chair bent and was not fixable so they had to order the part for the chair. Fast forward 9 to 10 months later, (after several phone calls asking for updates and management and customer service not knowing what was going on with the order), Mathis brothers finally received the part. The technician comes out and it is the wrong part. At this time it was revealed that, Mathis Brothers stopped doing business with the manufacture that made replacement parts and there was no fixing it. We were done messing with the poor customer service and inept management and asked for a refund. They refused and gave us store credit. We were determined not to give Mathis Brothers any more money for all the trouble we received doing business with them. We found a broken (discounted) side table and a Walmart quality kitchen dining set (two benches and a table) and ended up paying around $25 for the taxes.Since Mathis Brothers does not allow the display pieces to be purchased (except for the broken furniture for sale), we had to order the dining set and this was done February 2022 and once again, we were told the table would be delivered in two weeks. We asked for delivery, and they wanted to charge us $120. We declined. Two weeks comes and goes, and the shipment is somewhere between the Tulsa warehouse and the California warehouse. Sometime in March they agree to deliver the dining set free of charge. It is now May 27, 2022, and the dining set arrived broken. So, we once again send furniture back to Mathis Brothers. After dealing with them for over a year of multiple mishaps, poor customer service, and dishonest management - we asked what it was going to take just to get our money back and wash our hands of Mathis Brothers. I guess we aren't allowed to speak with management, so it was facilitated by a customer service rep that Justin Lewis (district customer service manager) once again denied our request for a refund, and we were told to wait for the next shipment in July 2022 before we get a third set of furniture delivered by Mathis Brothers. Needless to say, the quality of Mathis brothers has gone downhill and they lost two lifelong customers. We will NEVER do business with them again!"},{"reviewer_name":"Jon L.","rating":1,"date":"2021-11-16","comment":"Terrible service, no one gets back with you even after multiple attempts, ordered a Sofa in May and still waiting and can't even get updates from the store. I wish there was a Nebraska furniture Mart near, they have customer service like Chick-fil-a and Mathis is the McDonald's Ice cream machine always broke!"},{"reviewer_name":"Lisa D.","rating":1,"date":"2022-11-11","comment":"I was wondering why a store that sells such quality furniture has such low star ratings. Now I know why! The customer service is a sham. They take your order, your money, and then they hold on to your merchandise, and keep changing the date that things are supposed to arrive! They pass you along on the phone, put you on hold, pick up, hang up, pick up, hang up. I am waiting for a manager as I type this and they will not get on the line. I plan on going up there tomorrow and cancelling my order 10,000 dollars in bedding and they dont have the common courtesy to answer a call or give you definitive answers. If there was a zero star available, I would give them that. Mathis brothers sucks in my opinion. Sales is what they are interested in, not returning customers. Guess what? I've been waiting as I type and, they have just hung up! Never got a manager on the line. How about that for customer service? I WILL BE CANCELLING MY ORDER!"},{"reviewer_name":"Robin Y.","rating":1,"date":"2022-10-16","comment":"dont buy at mathis brothers in tulsa. we paid over $2k for a mattress and headboard 10/8 delivery was scheduled 10/9. was not delivered due to someone changing it from delivery to will pick up. no one admitted doing it. delivery was rescheduled for 10/16. they called and said the delivery truck broke down and they would be late. at 5:30 we got another call that they would not be delivering after all and rescheduled for tuesday 10/18. we told them that was unacceptable and we would be canceling our order. the manager & salesmen never returned our numerous calls. do not buy from these lazy liars. once they have your money they forget about you. shopped here for decades and we are done! check with the better business bureau before you step foot in their store. sorry we didnt do that ourselves. lots of horrible stories like ours at the bbb. we will file a complaint with the bbb too. people need to know these people are not the people you want to do business with. i came home & ordered exactly everything online & saved money too!"},{"reviewer_name":"Cassandra S.","rating":1,"date":"2022-03-08","comment":"Awful customer service.  I have four custom chairs from Mathis Brothers in Tulsa.  After having the chair repaired it was to be delivered between a time frame, they gave me.  I took off work and stayed home.  They did not call and let me know they were running an hour and a half late. They were not helpful when I called, and no one could tell me why they do not notify the customer.  Missed a dinner waiting on a chair and their Regional, Justin Lewis will not take my call or even bother to answer a customer complaint. Their resolution, we will give you 10% off your next purchase. When did TERRIBLE CUSTOMER SERVICE become ok?????"},{"reviewer_name":"William S.","rating":1,"date":"2020-08-02","comment":"I have seen many commercials where Mathis Brothers honors Veterans and their families.  I am curious how?   You don't offer veterans discounts.  What do you do for veterans.  I never felt more disgusted than today when the sales manager \"D\" said that he was giving me something special on 5% off a cash in hand purchase of $1500 on 2 recliners\"D\" appreciated my visit so much he told me I could pick out cheaper furniture or there were other stores in Tulsa.  There was no appreciation."},{"reviewer_name":"Theresa M.","rating":1,"date":"2021-07-20","comment":"Went in at the end of March and bought a couch, loveseat and coffee table.  When went to pay they told us the loveseat would be here the first of May.  Went ahead and paid.  Got the couch and table the next week(why they got 1 star). Never heard back.  Called in May said at the end of May.  I keep calling and they keep putting it off.  Now they are telling us it will be here in August.  Have never received a call.  When I questioned them they blamed the manufacturer.  Shouldn't sell furniture they don't have.  They have our money so they don't care.  Going to go in and get money back.  DO NOT BUY HERE UNLESS IT IS IN STOCK.  No customer service.  Sales person told us she would try and get our loveseat sent from OKC but when I called they knew nothing about it."},{"reviewer_name":"Undefined N.","rating":1,"date":"2021-08-17","comment":"Do not buy anything here if it's not in stock. They give you the COVID song and dance. I was told that because our chair was Ashley brand, it would be in in three weeks which would have been at the end of June. Let's see. Today is August 17 and no chair. I'm currently on hold and they are continually picking up the phone and putting it back on hold. Their customer service is non existent. I'm going to cancel my order and go somewhere that actually sells furniture that exists. STAY AWAY FROM THESE CON ARTISTS. Time on hold is now 30 minutes. No thanks Rick S. We already cancelled. We're done with Mathis Brothers."},{"reviewer_name":"Sharon I.","rating":1,"date":"2021-07-20","comment":"Went into store Saturday in Tulsa, OK and was told kids bunk beds, desk and chair plus loveseat and recliner would be delivered Monday and that I would receive an email confirming. I emailed sales rep Monday and still no response and today is Tuesday. Called store today and was advised it be the end of August at earliest before furniture arrives in store. Sooo zero customer service received at this point not to mention selling furniture under false pretenses,  after waiting hours inside store that day, to  only be fed a line of bull. Buyer beware!Sharon I."},{"reviewer_name":"Teko B.","rating":1,"date":"2021-04-12","comment":"delivery of our patio furniture went fine, but the delivery people did not haul away the old furniture as promised. We contacted the sales manager and were told that we had not paid to have it hauled away, even though we explicitly agreed to and thought we paid extra for it. We asked to talk with the salesman and were told that sales manager would email him so he could call us. Of course, we never got a call back. We won't be back - ever."},{"reviewer_name":"Chelce R.","rating":4,"date":"2020-01-24","comment":"Mathis Brothers contacted me shortly after this review to rectify the situation. It took a little over a month (which is understandable since the company had to remake the cushions), but we got new cushions! Still have the same sections, but at least it looks better not being so visibly uneven. Thank you!"},{"reviewer_name":"Harold H.","rating":1,"date":"2021-02-05","comment":"We purchased a mattress 11 years ago and was told at that Time that the mattress had a 15 year warranty plus a 10 year prorated the paperwork that we have on site mattress shows the same thing however they refuse to warrantee this because their policy has changed the mattress company is now only a 10 year warranty with a five year prorated. This mattress was the lady americana which is owned by Mathis Brothers and at that time was built in Oklahoma City this company is a jokeWe have bought over $20,000 worth of furniture from this company and will never set foot inside the store again if you can't live up to your warranty's then you should not be in business"},{"reviewer_name":"DeeAnna B.","rating":1,"date":"2021-03-22","comment":"I ordered 2 custom wing chairs last AUGUST 10, 2020 and was told they would be delivered December 2020 then February 14 then sometime in February and they have been paid for since December.   I was so disappointed that I went to the store and discussed with the manager who told me he would deliver two chairs that I selected from the floor on March 18th which he did not,  all to buy time for the custom chairs to arrive and they still have not arrived .  We have purchased a lot of furniture from this store and have never been treated so poorly.  The Manager, Jack, actually lied to my face promising delivery of alternate chairs on March 18th.  I will not ever purchase from this store again and I do not recommend custom orders."},{"reviewer_name":"Melinda G.","rating":1,"date":"2021-01-07","comment":"Updated - emailed in today 1/09/2021 per the request below AVOID AT ALL COSTS!! Absoutely the worst customer service and massive delays.  Our couch was supposed to be delivered 12/01 (order 10/20/2020) now here January 7, 2021 with yet another estimated futures ship date (there are at least 4 estimated ship dates in the system from what I saw - asked for a print up let's see if I get one).  After calling multiple times weeks apart due and not receiving a return call we finally  came down and are here now trying to get an answer, update, or simply get a different couch.  Initially when we started speaking he stated that if the couch started in production such as cutting fabric (his exact words) then it couldn't be cancelled.  I asked to be shown in the system where it said the fabric had been cut etc so we can't cancel and he could not show such and affirmed the only option was to refund less 40% and cancel.  We all know when you work in an industry with different companies/relationships there are further abilities that you have internally and to act as if that is not possible or even make a reasonable offer for someone that recently refinished their home from Mathis is absolutely insane to me from a service/customer service point of view.The best they could agree to (although I highly doubt it would be upheld) was a refund would be issued if it took as long as 2022 to get a couch.  I asked to take a photo of the screen showing the log of progress for our item and was told yes by Mr Charles King and he was opening his tablet up he then changed his mind and told me he no longer felt comfortable letting me do so but would offer me a discount.  I again asked to take a phot and why I could not do so he said bc it had info re shipping companies etc to which I offered he cover it with a post it note and he declined but said I could look at it again.  He offered to give me free delivery in lieu of looking again - I reminded him I already paid for shipping.  He looked back at the paperwork and said he would offer me a discount of 250.  Ended up with no resolution but an update that the couch should ship on 1/25 (again this is the 4th estimated shop date in the system)- so I will be back on 1/25 and seemingly every 30 days until 2022 when I will be eligible for the refund...  DO NOT GO HERE!  There were and are so many opportunities to simply make it right, cancel, etc and let us get a different couch."},{"reviewer_name":"Angela F.","rating":1,"date":"2021-11-06","comment":"Ordered sectional couch in May.  We were told 12-16 weeks for delivery. Still no couch.  I've called multiple times and each time I call I'm told a different date.  I've asked to be contacted when there is a change and never once been contacted.  I understand there are delays and supply chain issues that we cannot alway control.  What can be controlled is communication and contacting the customer to give them updates.  I've requested a sales manager call so I can try to get additional information and no one ever calls.  I've also asked to speak with sales manager when I call and i am placed on hold for over 30 minutes each time.***got a response to this message from Mathis Brothers asking me to email details which I did.  No response after 2 days.  Am I shocked? Nope.  If they were truly concerned and not just trying to save face, they would respond*** Update #2 - it's been over a week now and still no response from Mathis.  Clearly their Yelp responses are in attempt to look good only***"},{"reviewer_name":"Jaime M.","rating":1,"date":"2021-01-23","comment":"I ordered a chaise October 3 and was concerned how long it would take to get considering the delays due to COVID. My salesperson, Donny Latendresse, assured me it would be in by November 15 and even most likely earlier. I asked him several times if he was sure because everything was being delayed. He assured me this was the case. I called in December and he told me it was scheduled for January 19th. I called today and spoke with customer service and was told the middle of March but that was subject to change. Change, as in even longer. I feel like I was totally lied to so he could get the sale. Not interested in spending money at a place of business who operates with salesmen like this."},{"reviewer_name":"Latisha G.","rating":1,"date":"2020-12-02","comment":"I bought a table here during the first week of November. I bought this one because the one I actually wanted wasn't in stock. I asked for several different queen sized beds as well, which they \"didn't have in stock.\" My table arrived very damaged. One of the chairs was also damaged. Customer Service told me they would deliver me a whole new set, but that I would have to wait until March of 2021 because they had no more in stock. Unacceptable. They sent a repair man out, who was able to cover up the damages to one of the chairs, but he informed me there would be no way for him to fix the table. Mathis Bros sent their delivery team to pick up my table so they could \"fix it in house.\" I called two days later (after not hearing from them at all) to check on the status, when customer service told me it was irreparable. Okay, was anyone going to bother communicating that to me? We are now less than one week away from Thanksgiving. Should my family eat on the floor? They delivered my table even worse the second time.  Charles, the manager told me he would send me a gift card for $100 to make up for all the headache their store has caused me. I never received a gift card. That was just another lie on top of the rest they told me to get me to back off. Our family ate our Thanksgiving dinner on a brand new (but severely damaged and cosmetically ugly) table. I spoke to the manager, Charles for a third time and was told he \"had my same exact table in stock and would have it delivered in two days.\" It is funny how I was told I had to wait until March, but all of a sudden you have the table in stock? Upon delivery (this is the third time the delivery team has been to my home) the table was again, damaged before it ever got through my front door. Mathis Bros refused to refund me for the membership they charged me on top of the additional delivery fees. If you don't buy their membership, they only deliver your products to outside of your home. I live on the third floor of an apartment building and live alone. How else would I have gotten the furniture upstairs? Expect to pay $60 for delivery plus an additinal $79 if you want your furniture inside of your home. This is outrageous! If you shop around, there are plenty of other furniture stores who don't force you into buying their membership! I gave them multiple chances to fix the problem, but clearly they don't care about customer satisfaction and they only deliver broken furniture. Mathis Brothers is nothing more than a fancy thrift shop. I will never return here and I warn all my friends and family not to waste their time or  money here. This place deserves zero stars."},{"reviewer_name":"Leigh V.","rating":1,"date":"2020-11-25","comment":"Update: as seen below they reached out to me regarding my couch. They sent out a technician to see what they could do. The technician said it was the worst he had seen and there wasn't anything to do but recover it. I waited two weeks for a response and got none. I then called several times and finally got an answer. They said that it would all be at my expense. When I asked why they sent out a technician if they weren't willing to stand behind their product, they replied \"as a courtesy\". Since when is it a courtesy to waste my time. I had already had an expert tell me that the leather was a manufacturers defect and cannot be fixed. So once again the customer service proves to be non-existent. They do not stand behind their products. Now I have a high end couch that looks like it should be in a frat house."},{"reviewer_name":"Joseph S.","rating":2,"date":"2020-07-26","comment":"I purchased a sectional from Mathis Brothers on 5/24/2020 and once I went to actually pay for the sectional, the blue sales receipt printed out an estimated date of 6/16/2020 to which I questioned the salesman about, he responded by saying it was an estimated date and the items should be in the warehouse ready for delivery. My wife and I then left the store with the expectancy that our next time to hear from the salesman would be to schedule the delivery. We waited for two weeks to hear back from the salesman about the delivery scheduling process but had not heard from him. We decided to reach out to him on 6/8/20, he was on his day off and promised to reach out to us once he was back in the store. Unfortunately, he did not remember to reach back out to us, so I had to ask a second time about the delivery on 6/10/2020. Over the next few days, we exchanged a few messages to which he explained how the computer system works and estimated delivery dates. I am sure that this was to help me understand the process and further expressed that the sectional had a tag showing 6/21/20 and that he would check the OKC warehouse, and we found that it was unavailable. We were able to land on a delivery date of 6/25/2020 and our salesman informed us that he would connect with us as the delivery date was closer. We arrived at the week of delivery and still not heard from him or anyone from the delivery team, so I decided to connect just to check up on things. A day later I was told that the (Ashley Factory) was not sending any items out until August, with no specific date given. Later conversations with the distribution center I was told the items would be available on the 6/28 but because it was a Sunday, it was unlikely. I continued to have a discussion about the delivery which eventually led to my attempts to connect with a manager. The manager did not remember to reach back out as he promised in our first few conversations so I made a point to go meet with him in person. On my first trip to the store, I was told that I would not be able to meet with the manager at that time, so they sent my salesman to meet with me. I was reminded of the prior conversations, shown that the items were delayed, and promised a call from the manager. The call did not take place so I sent a message to the manager, who simply responded with his schedule. I returned to the store a few days later, and the manager basically informed me that the issue was due to Ashley's furniture and that he can give a piece of my sectional but could not give a date for when the rest of the items would be available. I am not sure if he was having a long day or not but he did not seem to be concerned with how we as customers may be feeling, especially since our funds had already been spent. I am not sure if Mathis Brothers stop caring once they already have your money. I work in sales and honestly would have expected more communication from the company, and better customer service. It is easy for a company to preemptively let clients/customers know that there have been some changes and challenges. I am not sure if the company is concerned with customers returning to shop with them or if they make enough money to not be concerned with situations like this. Prior to this my wife and I had a plan to furnish our living room, bedroom, and guest bedroom, but due to this, we are not sure if we want to shop with Mathis moving forward. I would like to believe that the salesman and the manager are otherwise better than what I experienced. I hope that this helps others that are planning to purchase during this time, make sure you get additional details about backlogged items and availability."},{"reviewer_name":"Ashlea N.","rating":1,"date":"2020-10-05","comment":"Mathis Brothers sold me a piece of furniture in July, that I paid in full for. It is now October 5th and I have not received the furniture or a simple phone call. I was expecting the piece in August but every time I call they give me a future date that it should be in and then several excuses why it is taking so long. I just wish they would have been honest up front or gave a realistic date. Also, the fact that I, the customer have to follow up every single time has been beyond frustrating. The motto should be under promise over deliver, not the opposite. They have had my money for months!!"},{"reviewer_name":"Audree' B.","rating":5,"date":"2020-10-03","comment":"Went here to buy a chair and night stand for my mom. My last furniture experience at a different furniture store was not as pleasant as this one. As soon as you enter your temperature and a small questionnaire is taken for covid. You are then handed a green wrist band that allows you to enter the store. Of course, there are sales reps there at the dot to greet you upon entering. Michael was there to help us. I explain what I was looking for and while he seemed like this may not turn out well it was opposite. I went with my grandmother whom is 76. It was an adventure to say the least but he was patient and didn't rush us. He answered every question and while a few chair were out of stock, he always made another suggestion. The overall experience was friendly and he even listened to my grandma tell him about all the chairs she has at home while pointing out others she maybe interested in. The store was thoroughly cleaned and I saw them changing sheets on beds while I was there. If you are hungry, they have a burger restaurant there. I managed to grab a few shots while I was in the store."},{"reviewer_name":"Lori G.","rating":5,"date":"2021-02-03","comment":"After going from furniture store to furniture store I have finally found my furniture place. And that is Mathis Brothers which  is because of CLAYTON HALE. He has my best interests foremost in his mind. He listens to me, advices and is very very honest. It is hard to find honesty in sales but CLAYTON HALE does it. I trust him totally in all my purchases. I have been working with CLAYTON HALE on furnishing my house for over 3 years. Thank you Mathis Brothers for hiring CLAYTON HALE who is a superb salesman and knows the business well.  Because of CLAYTON HALE, I will repeatedly return to Mathis Brothers and send others to shop there too. When you shop at Mathis Brothers, ask for CLAYTON HALE and you will get a wonderful, personable man helping you to find that special piece of furniture."},{"reviewer_name":"Stephanie H.","rating":5,"date":"2021-09-16","comment":"I always have a wonderful experience  when I buy from Mathis Brothers. My sales person is Clayton Hale, if you want someone to help you find what you need but isn't pushy about it, he is your guy!!! I plan to use Clayton every time I make my purchases from Mathis!"},{"reviewer_name":"Bonnie R.","rating":5,"date":"2021-08-08","comment":"Lynda was the best sales representative I have ever had the pleasure to do business with. I got my bed, some laughs and I am super happy with my purchase."},{"reviewer_name":"Stephanie S.","rating":5,"date":"2021-06-26","comment":"Very very good selection of furniture, probably the best in town! The only thing that stinks is sometimes there is a wait on some of the special orders. We had a great experience thank you Clayton Hail for helping us find exactly what we were looking for! It looks amazing in our home!:)"},{"reviewer_name":"Teresa S.","rating":1,"date":"2019-09-03","comment":"My husband purchased a LaZBoy recliner, he was wanting a swivel base.  The salesperson told us that for $100. any of the LZB's could be fitted, and it would just take them 5 minutes to do it.  Hubs picks up recliner a couple of days later.  Swivel base is sent along in a separate box.  No instructions.  He's been watching YouTube videos to try and figure out how to get this thing on.  Currently the swivel base is sticking out in front of the recliner by a couple of inches.  Never seen a recliner quite like it.  Apparently, only  if we'd paid the extra $69 for them to deliver,  would the base be installed.  Buyer beware.  Mea culpa. Update: In response to Rick S. of Mathis Bros., I sent an email with the order number and my husband's phone number. NEVER heard from them."},{"reviewer_name":"Kelly P.","rating":1,"date":"2020-09-17","comment":"Literally the worst customer service I have ever had in my life! They were supposed deliver a mattress to our home and we sold our current mattress and the day It was supposed to be delivered was when they let me know it had been canceled!!! RIDICULOUS!! They did not do anything about it and did not even offer an apology! We also ordered a bedroom suit from them that we scheduled for delivery. We told them an absolute timeframe when it could not be scheduled and yet they scheduled during that time. We are not missing our sons senior night!  Once again... No apology!  They totally don't care about their customers!! Never going there again!"},{"reviewer_name":"Danielle K.","rating":4,"date":"2018-01-22","comment":"My husband and I decided to do some shopping on the coldest day in January so we were dressed pretty casually (to say the least) and I was a little embarrassed to go in. Our first sales person didn't seem too interested in helping us and disappeared after about 10 minutes. Well, we actually wanted to purchase something and couldn't find him, so Clayton Hale happened to be walking by and answered some of our questions and then we asked him if we could switch to him as our salesman. He didn't treat us differently because of our attire and helped us design and pick out custom bar stools and purchase an item in the clearance center. Our experience with Clayton and purchasing area was great and we will continue to ask for him by name when we go to Mathis Brothers. If it hadn't been for Clayton's great customer service, we would have probably bought something at another location or online."},{"reviewer_name":"Keli L.","rating":5,"date":"2018-10-07","comment":"The customer service our family received from our salesman and delivery men was exceptional. Clayton Hale is wonderful at helping you find your \"just right\" furniture while keeping budget and quality in mind. Delivery men were also professional and quick."},{"reviewer_name":"Kailey L.","rating":1,"date":"2020-12-26","comment":"I ordered a sofa on Sept. 12th. I was told it would arrive in 8-12 weeks. I've been told for the last two months that it would be delivered to the store on Dec. 27th. I was just informed that it is now expected, with no certainty whatsoever, Jan. 18-23. My salesperson cannot tell me where it is, why it is so delayed, or if it even exists."},{"reviewer_name":"Bridgette Dawson Theis L.","rating":1,"date":"2019-05-04","comment":"I am just sick! When I purchased my two Lazy Boy recliners two years ago, the salesman talked me into purchasing the protection plan on both chairs for an additional $150.00. The plan covered my chairs for five years, and the salesman assured me the plan was connected to my phone number and a repairman would come to my home to make any Repairs service.      My mother, who was with me gave me bad reports about Matthis Bros repair and it worried me. I called on the one hour drive home to cancel it, but the people at Matthis Bros told me I could cancel, but they would not refund my money! What? So I kept it.      The first thing that happened was I we found a rip in the back side of one chair as we took it out of the box. I called Matthes Bros, and they said I had to bring the chair back, but they would not send in-home repair. So I loaded up the brand new chair and drove an hour to get a replacement. Since Matthis Bros was able to locate my transaction via my telephone number, I lost track of my receipt.      Last month I noticed the stitching coming out of a seam on the footrest. The store said my chairs are out of warranty and sent me to the third party in home repair people. They said they do not cover seems because it is a manufacturers issue. However, the photos they asked me to send showed a small worn spot, and they did cover that so they would send a repairman, but he would not repair the seam? So, I was to have the third party repair fix the worn/rip, then take it to Matthis bros and have them repair the stitching for a cost!      So I jumped through all the hoops sending the third party all the pictures of the underside of the chair with model numbers, serial numbers, manufacturer numbers, etc. One week later, the repairman came to our house, and he had the wrong material! The piece he had was for an Ashley recliner?      The most concerning part of that situation is that the material he brought with him would replace the entire panel, which includes the seams? Why did they lie to me like that? He was covering the warn/tear, but it would also fix the seams, which they did not cover? The girl at the third party repair led me to believe I would have another procedure to get that fixed? So the repairman took the material back and said he would get the correct piece ordered.      After two weeks, I called Matthis bros. The girl at Matthis brothers was beyond rude telling me they have no record of my Lazy Boy purchase. Somehow, my protection plan was attached to the Ashley chairs I purchased at Matthew brothers before I bought the replacement Lazy Boys. They said unless I can come up with a transaction number, there is nothing they can do to help me.  None of this makes sense? Why would they replace the Lazy Boy based on my phone number two years ago, but now they can't find it when I need service? This whole incident has been horrible.     I WILL NEVER PURCHASE A PROTECTION PLAN FROM MATTHIS BROS AGAIN...EVER! or furniture for that matter.  Buyer be aware!"},{"reviewer_name":"J P.","rating":1,"date":"2019-05-01","comment":"Such a dishonest, unresponsive,  lying company. Bought a coffee table, end table, credenza. And got it home which is in Arkansas. Opened boxes and lots of chips in paint. Before taking out I called and send pictures. If by design, I would return since the chips were not on floor models. Based on pictures they agreed and called the springdale location to confirm they had a repairman that could do the work.They sent a local repair guy, Jesus, from the springdale store. He took bunch of pictures and left no repairs. Ends up he worked on their lazy boy furniture and not wood/paint.No one came. The Tulsa store lied... and lied.Mathis Brothers is not a name you can trust."},{"reviewer_name":"Stacey J.","rating":1,"date":"2020-11-03","comment":"If I could leave a zero star review, that is what I would give.  Purchased a \"firm\" Serta mattress.  The mattress delivered to us does not even come close to the same firmness as the one in the store.  There is clearly something defective about the mattress we received as it sags way more than it should.   I went back to the Mathis Sleep Center to try the floor model to make sure I wasn't crazy and the floor model is definitley much more firm than the mattress we received.  The salesperson told me to call the mattress services customer service to resolve the issue.The first thing the customer service rep tried to tell me is that the mattress in the store has been tested many times so it naturally will be softer than the one we received.  She obviously didn't even listen to me and gave me a canned answer becasue our issue is the total opposite. Ours is way too soft to come close to being \"firm\".  (she has repeated that to me on subsequent calls too)  We have made 7 phone calls, each time we have been told that a \"manager\" will get back to us.  Still waiting to hear from a \"manager\"  I found it interesting, as I waited on hold for 15 minutes one day, that their slogan they repeat several times while one is on hold says \"We are not happy until you are sleeping comfortably\".  Well maybe you are happy Mathis Brothers but we are not sleepying comfortably. We are still waiting. During one call my husband was told we had 2 options.  One, we could contact Serta and go through their warranty procedure.   This is not a manufacturers warranty issue. It is a brand new mattress but it is clearly defective.  Mathis Brothers should stand behind what they deliver and replace it.  The second option is that we could choose another mattress of the same size, only it had to be a more expensive mattress, and we had to pay a $200 restocking fee.  Are you kidding me?  We have to spend more money and pay you to restock a defective mattress that you delivered to us that you cannot resell anyway?   What kind of customer service is that?This is the second time we have had customer service issues with Mathis Brothers.  They eventually made the first situation a few years ago right, but it was not easy.  They clearly do not care about making this situation right.We are purchasing a new home and will need at least two more beds and new furniture throughout.  You can be sure where we will NOT be shopping for our new home.  There are too many options for customers to put up with such terrible customer service."},{"reviewer_name":"Terrell W.","rating":3,"date":"2019-06-02","comment":"For the love of God...I do not need a shadow when I browse around a furniture store.  No one wants someone breathing down his/her neck like that.  Also, do you really need 3,0000 salespeople?  I felt like there was a different one making lame dad jokes everywhere I looked.  I am fully capable of asking questions if and when necessary.  Ugh.  I'll stick with Luxe and Howse."},{"reviewer_name":"Lisa R.","rating":1,"date":"2020-10-23","comment":"I live 2 hours away from the Tulsa OK store. In April of this year, I purchased 2 Lane recliners. I didn't purchase the extended warranty because I'd always gotten quality furniture from Mathis Brothers. Within a month the foot rest broke on one recliner and has a glitch in the rocking performance of the recliner. The seat on the other recliner sinks on one side and feels like I'm sitting on the floor. Flipped the chair over and a flimsy metal bracket was bent causing the seat undercarriage to sag. Put a long screw underneath it to halfway hold it up. Six months later, the upholstery has pile build up so bad the recliners look 10 years old. I paid $1100 for both recliners.  I was in contact with Mathis Brothers recently per their request 'Contact us if there's anything we can do to help'...which translates to 'Come in and buy something else'. Didn't hear anything else from Mathis Brothers. This will most likely be my last purchase from them. Goodness. \"In-home inspection fees, transportation of the product to and from the retail store, and to and from the Lane factory, if required, for repairs are the responsibility of the purchaser.\" So in other words, I continue to make the payments on the financing, then go elsewhere for my next purchase considering I live 2 hours away."},{"reviewer_name":"Pamela F.","rating":4,"date":"2019-05-01","comment":"We designed and purchased a custom dining room table set with the help of our salesman, Clayton Hale, several months ago.   He was very knowledgeable about the different aspects of each furniture line and truly tried to match us with a company that would fit our wishes.  After delivery there were many unacceptable issues with the table and after a lot of back and forth with Mathis,  a resolution was made.Today we returned to Mathis Bros. and Clayton spent time helping us search for a new table and chairs and was happy to do it.  It's obvious that he puts the customer first and really wants you to be satisfied with your purchase!  We consider him our \"furniture guy\"."},{"reviewer_name":"Jared B.","rating":5,"date":"2016-12-22","comment":"All too often people get caught up with writing negative reviews and not acknowledging the positive experiences. I actually came to Mathis Brothers today thinking it wouldn't go well. I got a bedroom set secondhand from someone who purchased it from Mathis Brothers a few months ago. All went well getting it delivered to my new room. I was SO excited to put it together and finally have a bedroom set. Well, in an unfortunate turn of events the head board was resting against the wall, when all the sudden it crashed to the ground snapping one of the legs. Okay, I was crushed. It was my birthday and the furniture that was just delivered to my house was broken. Next day I went to Mathis brothers to see if they could somehow help me. I met Catherine in customer service and after just a few minutes wait she said that they had a spare headboard in the warehouse. All I had to do was drive there and pick it up in exchange for the broken leg. I asked how much it was and yo my surprise she said it was free! Wow! Thank you so much Mathis Brothers and Catherine. I truly believe in quality and customer service above all else. I want to go back when I have future needs. And I want for others to know how willing to help you are. Thank you so much."},{"reviewer_name":"Desiree C.","rating":1,"date":"2020-04-25","comment":"I bought a recliner as a surprise for my boyfriend on 4/24/2020. I got it home and when he got in it the back just kept reclining so we brought it back the next day and got a different one instead. We got that one home and put together and the foot rest would not stay reclined out, just fell right back down if you put any pressure on it. So we took that one back an hour later. The customer service manager told me I should have checked it first, that \"he always checks his eggs at Walmart to make sure they're not cracked\" when they load it up it is in a box and then they tell you to leave so there was no way to check it and I didn't appreciate him implying it was our fault that your product was faulty. I explained that this was the third time driving 45 minutes there and 45 minutes home and I was extremely upset. He did give me a small discount off my purchase \"for my inconvenience\" when we went to the warehouse to exchange it we waited 25 minutes before we were even acknowledged. We had them take the third chair out of the box so we could test it. It had the same problem as the one we were exchanging. The customer service manager and their tech told us there was no issue with the chair, it was supposed to do that, even though I explained to them that the one in the store does not do that. Finally our sales guy came over and explained to them that it should not be falling back down that way. They brought over a fourth chair and it wasn't even the right one. Finally the fifth chair they brought over worked the way it was supposed to. The only pleasant part of our visits was Jeff Forrester, our sales guy. He was extremely helpful and very courteous and respectful. Other than him it was the worst shopping experience I've ever had and I won't be back."},{"reviewer_name":"Ra S.","rating":2,"date":"2017-07-09","comment":"Mathis Bros is the store we've consistently purchased furniture from for many years. We have numerous properties to furnish, and office buildings. The quality of the items we've bought has been good , and prices are competitive. However, I can't give a high rating for this store because the service after the sale isn't easy, or consistent. Delivery is a pain in the Arse.. No delivery I've experienced was without issues, and recently, on the day of our vacation, we waited thru several calls to \"push\" the arrival time, until the final call at 11 pm. I contactedmgt. the following morning and statedwe'd be leaving by noon, we were angry,and would be calling our credit cardcompany to cancel the transaction.Surprisingly, the furniture arrived at 11:30 am. Mgt. Offered to refund thedelivery fee. ( I've not seen it, yet )After reading others reviews, here, itseems we are not alone in this regard."},{"reviewer_name":"Miranda G.","rating":2,"date":"2020-05-11","comment":"Very disappointed in the delivery service. When speaking with a lady to set up the delivery she said I could request white glove service which includes the delivery people to wear masks, gloves & shoe booties. Which was great because I'm pregnant, have a toddler & we don't wear shoes in our home, and the obvious, coronavirus. Workers showed up with none of this on. When I brought it up, he bypassed the masks or the gloves and said I could put the booties on but I'll still track stuff instead because we have to go in and out of the house so there isn't a point. He walked away and got the couches. He then proceeded to stand walk around on the carpet and said I understand ma'am, looks like you got new carpets but the booties wouldn't have done anything. my husband wasn't home & had he been I highly doubt they would have blatantly disrespected me & my wishes they way that they did. Once I told my husband about it he was livid. I called customer service and the only thing they could do was offer me $100 gift card.. asked me if it was okay & only thing I could say was it was better than nothing. But honestly, what am I gonna buy from there under $100s and because of this experience, I don't really want to shop there ever again. Only reason I give 2 stars is because who helped me make the purchase.** this is for the Mathis Brothers at 6611 S 101st East Ave. Tulsa, OK 74133**"},{"reviewer_name":"Larry K.","rating":5,"date":"2017-01-24","comment":"I stopped going to Mathis Brothers 13 years ago due to feeling like shark food from the first step into the building. 13 years later MB is a much different environment. While a salesperson will address you when entering, they no longer make you feel as if you're the only thing between their children having food on the table or not. Julian Martin (my MB rep) was extremely polite and professional. He listened and didn't steer me into the land of the rich and famous. He became budget conscious with my \"must have list\" in mind and I purchased 100% of my list from MB. Overall, not only will I be returning again soon, I will now be another happy referral customer to MB."},{"reviewer_name":"Laura A.","rating":1,"date":"2019-11-07","comment":"I bought a sofa from Mathis brothers and when I went to pay the salesperson asked me if I needed permission from my husband before I made the purchase.   I told him since it was my money I did not.  :(.  Still like the sofa but never on earth would I spend $1 there again."},{"reviewer_name":"Nick S.","rating":1,"date":"2018-06-17","comment":"I've never been more dissatisfied with customer service than my recent purchase. The \"customer service representative\" JR was utterly rude, useless, and condescending . After waiting around all day for a delivery only to be told after calling that it wasn't coming as scheduled. 30 minutes on the phone with him arguing that it was our fault, it was Mathis Brothers mistake. I asked for a manager and he said they all went home for the day. Then when he realized it was their fault there was conveniently a manager around. Ridiculous! Then instead of getting our furniture today, Sunday, they can't get it out until Tuesday. I'm not really that upset about not getting my furniture when I was told. I'm extremely upset with the way I was treated by the \"Customer Service Representative\"."},{"reviewer_name":"Dawna J.","rating":2,"date":"2018-12-22","comment":"Well overall it wasn't the best experience.  After being constantly followed the entire time we were there like we were thieves or prey. We bought a $1300 bedroom set. They delivered it and everything seemed fine. This morning I wiped the dust off the dresser and a piece of the color (?) not sure if wood or what came off. So now I have a $600 black dresser with a white chunk in front?  I expected great quality. Now my significant other is pissed he wasted his money there. Ugh even if you pay for quality you just don't seem to get it these days."},{"reviewer_name":"Stace S.","rating":1,"date":"2018-06-19","comment":"Can I go lower than 1? This store is pathetic. After purchasing furniture for an apartment and moving to Missouri - I decided to get the matching stand. I ordered it online and my wife drove the four hours to pick it up. Once she got there, since she does not have the same last name she was not allowed to pick it up. All because of \"fraud prevention\". I called and could easily validate who I was. I figured I just need to authorize her. But sorry, \"fraud prevention\" forces me to drive there and get it in person. So I cancelled it, and get this -- I could cancel it and have it charge my card. So \"fraud prevention\" does not allow me to pick up an item but I can cancel anyone's item over the phone and give them a card to charge it too? Horrible customer service, terrible policies and a store that is too big to care about a single persons experience. Why give a shit when another sucker is walking through the door now.Update: 6/19/2018Currently trying to return the 7k worth of apartment things I previously purchased back to this zoo since they won't let me buy any matching items AND take them to my apartment. Sent a note to the \"social networking\" guy who by the way has a big job in front of him trying to deal with all of the dissatisfaction that occurs at this place (just read the reviews at this 2.5 star madhouse). I recommend anyone checking yelp reviews first, not go to this store unless they want to feel pain. I liken it to biting down on a wood file and having someone pull it out of your mouth real fast. After another 4 hours of driving home, these dumbasses NOW want to do \"try to help\". I already talked to three different people and my wife talked to two, all who were totally unwilling to help. Its obviously policy or some kind of herd mentality (training) to treat customers like shit. Why does the \"Social Media\" guy think he can do anything different. He gets paid by reply. I am tired of driving back and forth and being lied to by Mathis Brothers employees. Give me back my money! I say treat someone right the first time, and you won't need to hire someone to respond the bad reviews all day and night trying to make amends for what is obviously the way this company does business. The Mathis Brothers mantra is to have the largest stock, more than anyone. Which is easy to do when your support people are dicks so no one will purchase anything  and if you do purchase something like in my case over the web they won't let you pick it up and take it home."},{"reviewer_name":"Shylah C.","rating":1,"date":"2019-10-24","comment":"This was by far the worst experience with customer service I have EVER had . One star is to good for this company.  I bought thousands of dollars of furniture and EVERYTHING I mean everything that was delivered was damaged in some way . The people they contract out to deliver were very rude and hatful . When I called to talk to a customer service rep she said all the stuff could be picked up and they would deliver new furniture but again some of it was damaged . Dining table had a crack in the leg and the ended of the table was scratched up and some of the varnish was rubbed off . The coffee table had a chunk of wood chipped out of one of the legs and had a broken drawer . The bookcase had about 20 scratches . So I called Mathis Brother's again and asked for a manager . I was told someone would call me  . Days went by with no call back so I called again and they put a sales associate manager on which basically just had those things replaced again but I said no just come get it all but he talked me out of it and against my better judgment I let them replace it again . Which also I want to add my husband emailed a letter to Mathis Brother's and has NEVER heard anything back and this was almost a month ago when this all started . By the time they made a 3rd delivery a manager named Justin called and reassured me that this isn't the type of service they give and apologized . He said he would check on our delivery and gave me some  money back for all we went through however when the 3rd delivery came the dining table was broke where the leaf folds up and more scratches and scuffs on the bookcase . I called Justin and left a voicemail and emailed pictures . He responded several days later but by EMAIL !!!!!! So basically the management here is not good and don't care what service they give . We should of return everything the 1st time and went somewhere else . They make you feel like they don't care and that it's your problem. Also they should look into different people to contract out to for delivery.  I WILL NEVER GO BACK HERE EVER ."},{"reviewer_name":"Levi H.","rating":5,"date":"2017-07-03","comment":"Guys, let me to tell you about my Wife and I's experience at Mathis Brothers Furniture. It was so easy, walked in and was immediately greeted by Mr. Clayton Hale. He took us to all the furniture pieces that matched our criteria. He knew exactly where to go and not dragging us back and forth their huge selection of great furniture pieces. He helped us through the intire process, picking out the furniture, going over the build, structure, and quality, discussing the warrenty and protection option, and then the pick up or delivery options. When it came to pick up, the loaders were very nice and helpful. Never wanting us, the customer to have to do any lifting at all. I recommend Mathis Brothers Furniture to everyone. Thank you Clayton Hale for the great customer service."},{"reviewer_name":"Susan B.","rating":5,"date":"2018-09-15","comment":"Shane was very helpful in getting my bed fixed. Pleased with the quick response in taking care of me."},{"reviewer_name":"Brent R.","rating":3,"date":"2015-09-17","comment":"Yes, you will be pounced upon by a salesperson when you enter the store.  It's annoying unless you set some boundaries with this 'assigned' escort.  Simply tell them that you need space and will consult them only when they are needed.  Most of them are incompetent at interior design anyway.  Sadly, the prices can't be beat. If you can set the ground rules and want to save a little money-it's a good place to shop. It's tempting to use their financing but don't!  Their practices are either criminal or grossly inept.  They intentionally under-communicate and unilaterally make account changes that increase their odds of accruing finance charges.  Summary:Good selection, pricing and availability.Bad sales approach, product advice and finance dept."},{"reviewer_name":"Shaela F.","rating":5,"date":"2016-12-29","comment":"Yet another amazing experience at Mathis Bros! But this time, my sales rep, Clayton Hale, seriously knocked it outta the park if this woulda been baseball...it's a long read but totally worth it! So keep going!Last minute construction completion, Christmas creeping closer with only 2 days left til the big day, family coming in needing somewhere to stay; these were jus a few of the examples my horrendous nightmare was made up of, but Clayton crushed and calmed my nightmare by finding, picking out, purchasing, and delivering a full master bedroom set to me in my home in literally 24hrs!!! On Christmas Eve no less!! That's one of the biggest positives of this whole story, it was all done on Dec. 24th. Extremely speechless!! B-L-O-W-N*A-W-A-Y!!! Mathis Bros. keeps upping the customer service and quality bar every time I go to Mathis Bros! Most importantly, it's the priceless employees, in my opinion, that create the massive assets of their company. Clayton Hale went above and beyond what I would consider his job description at Mathis Bros. In fact, the boundaries of a sales associates of Mathis Bros. was probably miles behind the work he did for us!! I will always use him as long as he is employed by Mathis Bros! Such an asset to that company that if he ever takes another job offer it will surely effect their profits and business. I know I'll leave if he does. They out do theirselves every time I come in for another purchase, giving me an even more qualified sales associate, usually last minute emergency knowing me, every time being a bigger hurdle for them to try to jump thru, and yet every time they succeed. Can't thank everyone involved enough!!"},{"reviewer_name":"Simon N.","rating":2,"date":"2018-11-18","comment":"The sale person is really nice , but the store price very riff off ! I would suggest to the price check online for every that you want to buy , make sure that you got the lowest price on item that you buy!"},{"reviewer_name":"Diane L.","rating":1,"date":"2018-03-27","comment":"We bought this sectional 6 months ago for 2000.00. The spring has busted out and I have called Mathis brothers because it is under the 1 year mark. I have dealt with them for over 3 weeks. They had someone come out 3 weeks ago and supposedly went back with pics and ordered parts. I have called customer service every week for 3 weeks and the are horrible and just keep lying and saying they are rush ordering parts and they will get back with me. But they NEVER do. Then when u call they just laugh at you on phone. Don't EVER buy from them I will not EVER buy from them again."},{"reviewer_name":"Jamie K.","rating":1,"date":"2016-07-01","comment":"The Piranha's in this store drive me crazy. They are allover you -ALL the time. They make you feel like they have \"great customer service\", but when you find the one piece in their store that fits your needs-they mysteriously don't have it in stock. They tell you \"one\" is on its way and you can wait for that one. I came prepared to walk out with it in hand. Then the manager does not even have the good customer service to keep your business. He would rather you walk out the door without a sale than sell you the floor model-or offer you a good discount for having to wait for one to be shipped in. I am not ordering a special order-I should not have to wait \"maybe 3 days or more\". A direct quote from their sales girl. They can't even tell you when it's going to be in!  They have LOST a customer for good and I will tell everyone I can. They have HORRIBLE customer service!"},{"reviewer_name":"Shonna Y.","rating":1,"date":"2017-09-22","comment":"I SUGGEST NEVER BUY FROM THEM!!!!I ordered two beds from Ashley furniture. One was fulfilled by Mathis brother furniture. It took weeks to receive bed. I get it with the headboard damage. Was told someone would call me regarding the damage. That never happened. I called them. Was told to send picture of damage which I did. Still didn't hear back. So emailed and called again. Finally a girl calls and wants to set up a repair. No discount offered. I tell them that is not acceptable I want headboard replaced. She can't do anything and says she will send to Mgmt. Which I had already sent damages to. Was told they would contact me the next day. Still have not heard from anyone and left more message."},{"reviewer_name":"Tracee P.","rating":1,"date":"2018-03-21","comment":"Do NOT*NOT*NOT*NOT shop at the OKC Mathis Brothers Furniture store! You WILL REGRET IT!!!!! They promise you the moon and the stars, but you receive nothing but an empty wallet...We purchased $3,500 worth of furniture...two days later they called and said they made a mistake and needed more money...seven days later they called again and said they made a mistake and again needed more money. The problem is, when you purchase the furniture you sign a contract that 40% is non-refundable so you can't NOT say you don't want the furniture when you have a problem down the road, or you will lose the 40% that you have already spent. So, it's either pay the extra money or lost the 40%! Yeah, like we said ... Do NOT*NOT*NOT*NOT shop at the OKC Mathis Brothers Furniture store! You WILL REGRET IT!!!!!"},{"reviewer_name":"Phillip H.","rating":1,"date":"2017-01-27","comment":"They have gone downhill. Waited 20 minutes for the very nice sales associate to get a hold of his idiot boss only to find out they couldn't sell us a floor model of a bench. Don't go there unless you are prepared to wait 2-3 weeks to get what u want."},{"reviewer_name":"Cheri S.","rating":5,"date":"2015-12-05","comment":"I have enjoyed shopping here for years. I found a loyal, talented salesman there years ago that made my interior design career so much more convenient. Congrats to new store manager, Joey Goodwin."},{"reviewer_name":"Kristin H.","rating":5,"date":"2017-12-25","comment":"Earlier this year I purchased a couch and love seat from another furniture store and within months it was having problems, after contacting their customer service multiple times the store would not stand behind their product. So off to Mathis Brothers I went in search of new furniture yet again, only this time I went in with extreme caution and fear of the same issues. Instead of a salesperson only looking to make a sale I met Clayton Hale, the most fantastic salesperson ever!! Clayton spent an enormous amount of time showing me every piece of furniture I asked about and was able to explain everything about each piece. When I decided to custom order a sectional he than spent hours helping me pick out fabrics and if that wasn't patience enough he never even flinched when I said I have to sleep on it and left. Finally a few days later I returned once again looking for Clayton Hale and purchased my sectional. Clayton explained the whole custom order process thoroughly and let me know exactly what would happen. I am happy to say that my furniture was finished before expected and delivered quickly. One last thing I must mention is the amazing delivery team, I have never met any team that was so careful and considerate of my house while delivering and setting up my new sectional. They took extra precautions to protect my door and furniture as it was a tight fit to get in than made sure they were super careful of my floors and walls!! I will never shop another furniture store! P.S. I went back in just a few days ago to buy another piece and Clayton Hale treated me like an old friend and again helped me pick out the perfect piece!"},{"reviewer_name":"Barbara M.","rating":2,"date":"2019-05-20","comment":"My husband and I have purchased most all of our furniture from Mathis Bros. We have had a good experience with most of our purchases. There was a time when we almost stopped going there because of the sales help. My husband and I went in to shop and decided to use the restroom before we started looking for our furniture. We were pounced upon as soon as we entered the store by a sales associate. We told him we were just browsing and we going to use the restroom first  The sales associate followed us back to the restrooms and stood outside of the restrooms waiting for us to emerge so he wouldn't lose a sale I suppose. I found this repulsive. Then he continued to follow us around in the store like we were there to steal something. After we reported him to the manager, we were told they were going to change the way customers were greeted. By this time it didn't matter, we left the store very frustrated because my husband and I were not able to have a conversation between us without the salesman trying to butt in and the fact that he was waiting outside the restrooms like a vulture ready to attack.My husband and I were ready to try Mathis Bros. again since they were going to change the way customers are greeted.This time the salesman greeted us at the door, was very nice and polite. We told him that we were looking at several things.  He pointed us in the right direction and ask if it would be alright if he checked on us occasionally in case we had any questions. We did end up purchasing a number of different pieces. This is where the problems began. The salesman set us up for a delivery date. The furniture was going to be delivered on a Tuesday. We were going to get a call about 30 minutes before arrival. Tuesday came and it was getting late, we still hadn't received a phone call. My husband decided he would call to find out if they were still going to deliver. The foot board to the bed was not in stock after our salesman said everything was there. Well don't you think that we should have received a courtesy call? There were a lot of other things I could have been doing instead of sitting at home waiting for a delivery that never came. So they told us it would be the following Friday. Friday came and we sit around waiting on our delivery. It became late, so my husband makes another call to Mathis Bros. They assured us that the delivery was going to be made. The lady he talked to said the truck was in another area but as soon as they were finished there they would bring ours. The delivery showed up at 10:30 pm. The delivery gentlemen could not have been any nicer. They finally got it all set up and left our house at MIDNIGHT!!!!  Midnight??? Who does that?Barbara M."},{"reviewer_name":"Jessica Z.","rating":5,"date":"2016-09-07","comment":"I wouldn't go to any other furniture store besides Mathis Brothers. They have the largest selection and variety of furniture, they have the fairest prices--anywhere from low to extremely high-- and you get what you pay for, which is what I like from a furniture store.  I have never encountered a bad sales person from here. And I just bought some new couches, decided I hated them, called the next day, and two days later they delivered the new ones I picked out! It was super simple and very little, to no, stress!!!"},{"reviewer_name":"Terry F.","rating":1,"date":"2020-07-08","comment":"This is the second time I have done a review for the same issue. The previous review has disappeared???We currently still do not have our sofa that was paid for in September of 2019. We purchased a over $25,000 in furniture for our lake home. Then went back in to purchase for our home in town . I ordered a custom sofa. It was ordered in September 2019... when delivered it was damaged. It was reordered and came back in in early march. 7 MONTHS!!!!We could not take delivery due having to quarantine due to covid. When I was able to t take delivery (two weeks later) I was told the sofa I paid for and custom ordered 7 MONTHS ago has been \"accidently\" sold. WHAT?????? So it was reordered again in March. No one is calling me with updates or offered a discount of any kind. I am now into my 11th month without a sofa. Called last week. was told early July. Called today was told late July. I will NEVER do business with Mathis Brothers again. No one cares. Ryan our sales guy is now a manager. Big mistake. When trying to understand why this all happened Ryan rolled his eyes and walked away.... He did not walk away when a large commission was involved. This was in Tulsa, Oklahoma"},{"reviewer_name":"Kelly P.","rating":1,"date":"2020-06-12","comment":"We used Mathis Brothers over a decade ago and had a negative experience, but tried them again. This has been the most unfortunate 7 months trying to get our orders in and correct which is still is not. We were not told the correct price until order was placed, which then it was $800 more. Once our pieces arrived we were never contacted, then when I reached out to our salesperson his reply was oh yea I saw that last week and meant to call you. Unacceptable. Part of our order was incorrect, 4 months still trying to get it correct. He assured us since we had to wait he would have the item sprayed 24hours in advance so we wouldn't have to wait when picking it up. We arrive at pickup, has not been sprayed. We received the \"let me check and call you right back\" with no returned phone calls. We call multiple times to try to get our pillows correct and no one knows so we'll need to call you back. Shockingly they've been sitting in the warehouse for an undisclosed amount of time...they will now at no charge deliver it to us. We schedule a date and time. That date and time comes and no one shows with the delivery, it's now moved to the next day. Mathis Brothers has lost our business sadly, and also sadly they are the recipient of my first negative review. A decade ago they were not customer service oriented and they still aren't. I'm gladly now giving my business to smaller local stores that are pleasant to work with!"},{"reviewer_name":"Maggie T.","rating":4,"date":"2016-02-14","comment":"I always dread stepping foot into Mathis Brothers..so why the 4 stars you ask? Because they have the biggest selection and every price point from the budget shopper to the high end if you want to special order. So, that usually means I end up here when I need something for my home. They have a major reputation for swarming, stalking salespeople that makes the shopping experience so uncomfortable. I do not understand why they have not changed their sales model, apparently they just count on the fact they are one of the biggest in town and can get away with it. Now when I go in I just let the salesperson know that I want to shop alone and I will find them when needed. Today I found an end table at a decent price and no doubt the next time I need something I will be back again."},{"reviewer_name":"Amanda T.","rating":4,"date":"2017-04-30","comment":"Great selection. We managed to get one of the best showroom salesman we could ask for. Not pushy, they let you shop and tell them what you would like. Great prices and warranties."},{"reviewer_name":"Judy F.","rating":1,"date":"2016-04-04","comment":"It's me again...just wanted to WARN people so about the poor service and rude people...Remember NEVER buy anything from SUNSHINE FURNITURE!! MY furniture  never left the building and they still charged me a 10% cancellation fee!! And SUNSHINE FURNITURE still refuses to give me my money back!!! All if this because of the salesman DW'S INCOMPETENCE!!!  SHOULD BE A ZERO STAR!!!"},{"reviewer_name":"Diana F.","rating":5,"date":"2017-06-05","comment":"Furniture shopping can be exciting, exhausting and expensive!  Clayton Hale has made every shopping experience at Mathis Brothers Furniture in Tulsa a pleasant and smooth process with the absolute best prices!  I continue to receive the best service and quality furniture after several shopping excursions!  Thank you Clayton Hale!!"},{"reviewer_name":"Ck L.","rating":1,"date":"2015-10-09","comment":"Be CAREFUL!   I learned a lot shopping at this store for recliners. We found two that we liked, with a price on them. We were told that they could add a swivel for $99 and could easily get the third one. We were ready to write up the sale. Then came the surprise. The entire order became a \"custom order\", they wouldn't sell from the floor, and even though we were ordering the color on the floor models, (standard) they called it custom fabric order. The price for each recliner went up over $215 dollars EACH!  We walked out, went to another store, bought the same recliners for less than the starting price of the ones at Mathis, and no EXTRA fees."},{"reviewer_name":"Raylene D.","rating":5,"date":"2017-02-21","comment":"Surprisingly good customer service! I few years back I purchased my first couch with Mathis and just a week ago I purchased a dresser for my bedroom. I loved the dresser when I saw it on the showroom floor unfortunately when it was delivered I was not so happy. The color looked so different from what I had seen in the showroom (lighting can be very deceiving) and it just looked so dark and heavy in my small bedroom. I went to ask them about the color discrepancy and they were nice enough to pull one from another lot and let me look at it to see if it may have just been manufacturer variation on the stain from what was on the show room. In the end the piece just wasn't what I was wanting and I wound up returning it. Jess processed my return and setup pickup time. She was very sweet and helpful, despite not keeping the dresser I would still recommend mathis because of what great customer service they have."},{"reviewer_name":"Rick F.","rating":5,"date":"2017-05-14","comment":"Quality at a discount. The delivery guys were great. Polite and hard working."},{"reviewer_name":"Addie D.","rating":5,"date":"2019-04-26","comment":"Great customer services and everything was delivered in perfect condition. Thank you Clayton Hale for you patience with us and your excellent customer service."},{"reviewer_name":"Collette L.","rating":4,"date":"2017-07-21","comment":"We usually dread Mathis Brothers because the sales people are obnoxious. But, a while back we went in and had a great sales lady named America. We told her what we wanted and she showed us everything she could find to fit our needs. She is the best sales person we have ever had in ANY furniture store. I hope they value her as an employee.We were just looking that day. We are not the people who buy what we do not want. if we don't like it in the store we will hate it at home. We did not get a chair from them that day but i plan to go back today shopping for me. It is hard to find a recliner for very tall or very short people... I want one that is NOT plush... I hate sinking into furniture and I hope America is working today.... If they have something she will find it, lol."},{"reviewer_name":"T T.","rating":1,"date":"2016-08-29","comment":"From being accousted when we first walked in, then to a horrible shipping experience, our shopping at Mathis turned into a regret. The first time my wife and I visited the store to select furniture we left because we could not hold a conversation without being continually interrupted by sales associates. A few weeks later we wanted to give Mathis another shot and solely purchase a bed frame. Bed frame was back ordered two weeks which was no problem for us. We also purchased a sofa and mattress from Ashley and the Mathis sleep center, no significant issues there up to checkout. Went to distribution center to have the two orders combined for delivery and all worked out well once I had the clerk correct the double delivery fee since it would all be one load from one place to one place. I was contacted nearly two weeks later telling me furniture was in and ready for delivery. I take off work to accept the delivery and there was no bed frame with the delivery, mattress, but no frame, and the sofa was damaged from delivery. Had delivery call back to warehouse to find out bed rails can't be found and will need to postpone the whole frame for shipment. So I make another date to take off work and the delivery arrives 2 hrs before the time Mathis gave me and since I could not be home at that time the delivery moved on to not deliver. I call and the best the clerk could do for me was to schedule another date 3 days later. Not too thrilled I call back for a manager and the clerk stated none was available and my only option was to either take another shot at delivery or pick up the bed frame from the warehouse. I decided to end the madness and pick the items up myself since we needed the bed for visitors that night. I arrived at the warehouse and handed my ticket over. Customer after customer arrived after me and left before me with great loads as I waited for my two smaller boxes. I asked the worker I handed my ticket too and he said he had no idea about where mine was and that I should walk into the warehouse to find someone in charge. So I find someone in charge and he points out that they are ready to load my truck. The boxes needed to be wrapped in plastic, as they did for other customers, due to heavy downpour. But they did not want to since they already placed the boxes in the truck. They said if the frame gets wet to just bring it back to customer service for an exchange...yup. That wait took 35 minutes. This will be a review on Google and others, to spare other potential buyers the headaches with dealing with Mathis bros."},{"reviewer_name":"Bud K.","rating":4,"date":"2017-04-20","comment":"I am giving a 4 because two previous attempts to get information were a failure from the Customer Service for Mathis Brothers in Tulsa but the third attempt gets a 5 star.    I called back for the third day to get part information  I need for repairs after a lightning strike took out recliner motors.   I got Shane Jobe and though frustrated after the 2 previous attempts, he assured me he would follow up.    Not only did he follow up but did it in a timely manner.   I actually got a call back from him the same morning!!   Wow has not happened before.     He provided me with the information in an email, while on the phone.  He also provided additional information about getting the repairs made.So great job Shane!    Hope I do not need this service again but if I do, I hope I get Shane!"},{"reviewer_name":"Lois J.","rating":1,"date":"2018-09-20","comment":"I placed an order for a new reclining sofa and took several days checking out fabric swatches before deciding on the perfect one.  Placed order, paid the down payment with check (my first mistake).  Received call 5 days later the fabric I selected wasn't available for the sofa I selected.  (Hmmm...shouldn't someone have caught that when I placed order)  Needless to say, order cancelled and even after talking to multiple cashier supervisors (I admit I wasn't nice, was one of those irate customers) I have to wait 10 business days for my money to be refunded.  Took my money immediately by ACH, didn't get anything to return but yet have to wait on my money to be refunded.  I will never step foot in a Mathis Brothers store again as they did not care to keep me as a customer."},{"reviewer_name":"Jacob S.","rating":5,"date":"2011-08-25","comment":"I'm just adding on to my wife's (Katharine S.) review.We went in looking for a living room set after looking at a couple of others places which were terrible around Tulsa. There is a reason their store is so big, it's because they sell top grade furniture and make sure their customers are happy. I can tell most of their employees enjoy working there except the customer service area (which got rude with my wife). Luckily higher management saw that I refunded the complete $5000 after having issues with delivery and alleviated the situation. The service agent that helped me pick my furniture out didn't know of any problems, but was willing to do everything he could once he did find out what happened. It's hard to run a business that big and not have a couple bad eggs every once in awhile, so I will definitely shop there again because I know there is a huge selection, great customer service, unique pieces to Tulsa, and great prices."},{"reviewer_name":"Sharon F.","rating":1,"date":"2016-07-04","comment":"Went into today at the 71st Street Mathis Brothers to look at entertainment centers. Was met by a salesman at the door. After he showed us only two entertainment centers which was nothing like what we told him we were looking for, he rudely said \"Well you might as well have someone make it for you because your not going to find those anymore.\". We were looking for an entertainment center at about 58 inches tall. I will just keep looking till I find what we are looking for. It just will not be at Mathis Brothers. Guess he was pissed because he had to work on the 4th of July. If that is the case he needs to get into another line of work. Rude ass................................Too bad I did not catch his name."},{"reviewer_name":"Connye A.","rating":5,"date":"2019-02-15","comment":"I have to give a lot of Kudos and a shout out to Clayton Hale who is always so helpful.  He is knowledgeable and listens to what you need.  He is so patient and allows you time to think it over.  He has helped me in the past and when I need advice on furniture, I know I can count on him to point me to the best value for my dollar.   Thanks!"},{"reviewer_name":"Charlie N.","rating":5,"date":"2019-02-14","comment":"I've had multiple visits, all of which has been pleasant. I've had the privilege of working with Clayton Hale, who has been very helpful and laid back. He's very knowledgeable and is great to work with. The delivery team is friendly and diligent in their work. I've had one issue with a scratch on some furniture and the problem was quickly remedied. I'm thoroughly satisfied with the services provided by Mathis Brothers."},{"reviewer_name":"Apryl P.","rating":1,"date":"2018-06-08","comment":"If i could leave a zero star i would. Sales manager made a shipping mistake and was both rude and disrespectful when attempting to find a solution. He made several disturbing comments and in the end would rather cancel the order than make any alternative delivery attempts. Next purchase our family makes we will likely shop elsewhere."},{"reviewer_name":"Gary C.","rating":1,"date":"2018-02-26","comment":"RUN DON'T WALK from this place if you live out of town.Paid 4k for assorted furniture PLUS 200 plus for delivery. After 2 emails and numerous phone calls it's still not delivered.To be totally honest they called the last 2 Saturdays to tell us they would be delivered between 9 and 12. AT NIGHT.I'm serious. The last guy called at 1015 pm to tell us he'd be here by midnight and would be done setting up by 3am.We said NO!!!  So the guy said he'll bring it back Thursday. They first told us they ONLY deliver to this area on Saturdays. We call and after waiting on hold for 2 different people to find a manager James comes to the phone and listens to my wife explain the entire fiasco and says he'll call back within 30 minutes. 4 hours later he calls and leaves a message basically telling us the same story but with no remedy. Finishing up with ...it will be delivered Thursday. I've used them 13 years back and it was good but somehow they have it in their mind now that it's ok to make deliveries in the middle of the night like an illegal drug transaction. The neighbors will understand I'm sure when a freaking furniture delivery trucks back up beepers fire up at midnite.Then act ignorant when we call to inquire. I'd cancel if it wasn't such a hassle.LAST DIME I'LL SPEND ON WORTHLESS CUSTOMER SERVICE JOINT THAT TAKES YOUR MONEY AND FORGETS YOU."},{"reviewer_name":"Logan H.","rating":5,"date":"2019-01-22","comment":"I purchased a La-Z-Boy recliner from  Mathis Brothers with a manual side lever. Once home with it I found it very difficult to pull the lever up and push back to the reclining position due to my decreased strength caused by aging. I contacted Mathis Brothers and told them of my dilemma.  My salesman Josh R. was extremely accommodating; he told me to come in and find one that I \"absolutely love\"  which is exactly what I did. The customer service dept was friendly and eager to help me. My new chair is perfect for me!  Customer service is important to me and I highly recommend Mathis Brothers for future furniture purchases."},{"reviewer_name":"Elizabeth C.","rating":5,"date":"2018-11-05","comment":"Clayton Hale was a super salesman. We had a wonderful experience with him picking out a new couch and chair. He was very helpful Showing us all the styles in our budget. I would definitely ask for him again."},{"reviewer_name":"Joseph D.","rating":1,"date":"2013-09-14","comment":"Wow way too many sales people! Leave us alone for a second so we can think and talk between ourselves! If we day we are looking then let us look. That isn't an invitation to start attempting to sell us on features you don't even know matter to us.  If you want to make your commission then its better to listen! Hear what we want in an item and then sell us on those features and the benefits of them, not what you assume to be important. Huge selection at high prices and we wont be back. Ashley Furniture here we come."},{"reviewer_name":"Michael B.","rating":5,"date":"2016-10-31","comment":"The absolute best furniture store in Tulsa!!! Our salesman, Dennis, was very knowledgeable and was easy to work with. My wife and I will definitely be back in the future."},{"reviewer_name":"Jill S.","rating":4,"date":"2016-10-21","comment":"I know nothing about sales, so maybe the way the  Mathis management has their sales people line up to snatch their prey is the best way to handle customers, but I don't like it. My husband and I were fortunate to get Jacob as our salesperson. He told us what we needed to know and gave us space to look for ourselves.  Once we needed help, he was with us 100%.  Now, each time I go into Mathis, I ask for Jacob and receive a name tag with his name, so the other sales people know that I'm \"taken\" and they leave me alone.As for the store and their products, if you don't see what you want on the floor, they can order it for you. They have a wide range of styles and quality. Designers are there to help coordinate your choices. We were also very fortunate to meet an amazing designer. She knew exactly what my needs were.I do have a complaint about customer service. The young man who answered the telephone asked what I wanted him to do about my issue instead of telling me how he was going to help me with my issue. He should have been trained, before answering the telephone."},{"reviewer_name":"J R.","rating":5,"date":"2016-12-14","comment":"Jordan Diamond has been a pleasure to work with! Not pushy, very knowledgable & has his eye out for us. Helped us find the perfect (very unique) sofa! Great experience with Mathis and with Jordan in particular!"},{"reviewer_name":"N.C. F.","rating":2,"date":"2015-01-30","comment":"We recently went back to Mathis Brothers after our previous great experience-- this time to look at dining tables. Unfortunately, we got a real dud of a salesperson. I told the woman what we were looking for, and she basically just pointed towards the dining tables and said \"they're over there, my name is [don't remember]. Just give \"them\" (whoever that is) my name when you're ready to check out.\" In other words, \"I'm not actually going to help you, but make sure I get a commission if you buy something.\" After wandering for a bit and coming up with some questions, we finally found the woman again. I asked my questions. She knew absolutely nothing. (Things like: do you carry any tables in X brand? I am looking for a particular style from X brand.) I think I might have even rudely laughed in her face at how absurdly uneducated she was about her job and the products she sold. We gave up and left.Lessons learned: If you find a good salesperson, remember their name and ask for them. If you get a dud salesperson, ask for another one."},{"reviewer_name":"Martha C.","rating":5,"date":"2018-04-09","comment":"We just moved to Oklahoma from Colorado, however the moving company we used didn't get our furniture to us in 3-5 days as they had promised.  On about the 25th day, my husband and I went to Mathis Brothers to see if we could find a couch and walk off a little anger at the movers - we really didn't have any intention of buying that evening.  We were met at the entrance by Clayton Hale, told him our tale of woe, and he gave us an overview of the showroom layout, where different furniture options would be, then let us wander about saying he'd check on us from time to time.  We found living room furniture we liked and Clayton showed up just when we had questions.  There was no pressure at all, just excellent information.  We ended up buying living room and dining room furniture as well as a couple of rugs that we absolutely love. We picked up the rugs the next day and the warehouse people were super - asked us if we wanted something to drink whilst we waited, then helped us load the rugs in our car.  They were very nice and respectful.  The furniture was to be delivered the next day, which it was and the delivery people were also great - very fast and efficient whilst treating our furniture and home with care.  There were a couple of items on backorder of which we were aware, but one item we expected to be delivered ended up being on backorder.  It was no problem for us since we did get our couch and now had something to sit on :), but Clayton Hale called us that evening saying he had checked on our delivery and noted the backorder.  I was so pleased to receive this call, especially since it was unsolicited!  I'm not at all used to this level of customer service on all fronts!  Clayton checked on our backordered items, got the delivery reschedule within just a few days.  He continued to keep up with our order and after both deliveries, a customer service rep called to make sure all was delivered well and Clayton checked in with us as well.  I'm sold on Mathis Brothers and can't imagine needing to look anywhere else when we need more furniture."},{"reviewer_name":"Dina H.","rating":2,"date":"2015-01-12","comment":"Two years ago we purchased a leather sectional at Mathis Brothers and had a great experience, so when we needed an ottoman our first stop was Mathis Brothers.  We arrived close to closing so we hurried to find the ottoman we wanted and the sales person could really care less since the purchase was less than $250.00.  He told us they were out of stock, but if we would go to Factory Direct on Monday we can pick it up there.  We went there today, and they too were out of stock and have been for sometime.  I also noticed the same ottoman on their floor was less money. I spoke to a Sales Manager at Mathis who was nice and advised me the ottoman will be available around the 25th, which was fine but then I also needed to file a claim with the extended warranty on the sectional, without going into details my claim was denied.  Please learn from my mistake, fully read what the extended warranty covers before paying the extra money, in my opinion it's a waste of money.So after dealing with a sales person who gave us the run around (literally), seeing the same product at their other store for less money ( I guess you pay more to shop on 71st then on Sheridan) and my debacle with the extended warranty, I will no longer shop at Mathis Brothers or their other stores."},{"reviewer_name":"Shelli M.","rating":2,"date":"2019-12-28","comment":"I would have given a 5 but picking up our items changed everything.  Our sales person was very nice and helpful.  Paying for our furniture was also fast and easy. But when we picked up our furniture it happened to be raining a little. Our salesperson has told us no worries they will bubble wrap and make sure it is sealed up. When we arrived to pick them up he said they didn't have anything large enough to wrap it in and what they had would just tear. So they tried to give them to us just in the boxes.  We had told our sales person we could wait to pick them up but like I said he assured us that they would be sealed up.  We also bought the protection plan which was a joke because they opened our boxes to the recliners and just treated what they could see.  The recliner is in two pieces by the way so it is impossible to treat it all.  So they put the lid back on the box and just wrapped what they had to basically. No bubble wrap at all.  My husband even heard a guy say don't use the bubble wrap it is to expensive. Pieces of the boxes were still exposed. My husband asked to see the manager so they called the sales manager out to the warehouse.  He came out and spoke to the manager in the warehouse but never stopped to talk to my husband.  It's sad that they have good furniture at good prices but then once you pay I guess it doesn't matter how they treat you!  You spend all that money and the satisfaction of the Customer comes down to a little bit of bubble wrap."},{"reviewer_name":"J O.","rating":4,"date":"2016-09-06","comment":"My husband and I purchased several pieces of furniture on (9/2/16) Friday afternoon/evening at the Tulsa store off of 71st Street.  We were advised we would receive our delivery Saturday (9/3/16) - and that we would receive a call to let us know the 2-hr window of time for the delivery.  We waited at home all day Saturday with no call (Labor Day weekend).  At 4pm I called the store and Customer Service advised me our order was on the 'Same Day Truck' - which only delivered between 4pm and 9pm (would have been good to know that Friday evening so we did not waste a whole day of a holiday weekend sitting at home).  I was told we should receive a call around 4:30pm that day (Saturday) to confirm the delivery timeframe.  At 6:30pm I called the store back again; only to be told that the order should be delivered by 9pm.  Again no call and ultimately no delivery on Saturday.Sunday (9/4/16) at 11am I called the store again.  This time I spoke with a wonderful Customer Service agent named Kyle.  After explaining the situation to Kyle (he allowed me to fully vent my frustration - which I greatly appreciated by then!) he was also baffled why we had not received our delivery on Saturday.  Kyle investigated the situation with the delivery group and found out the Salesperson had initially put the wrong delivery address into the order system (our mailing address, not the street address of our home).  Friday evening the Salesperson went back into the order system and changed the address to the correct street address -- but did not tell anyone he had done so.  That being said, the furniture was not placed on the correct truck for delivery on Saturday.Kyle was so helpful and patient in ensuring the issue was resolved for us.  Kyle had our order put on the 'Same Day Truck' that day (Sunday) and promised us we would have our furniture that afternoon/evening.  Kyle also obtained approval for us to receive a credit on our account toward the delivery fee for our inconvenience.We received a call from the delivery team (Dave and Nick) before 4:30pm that day (Sunday) telling us they were on their way and we were their first delivery!  Once they arrived the delivery team were professional, efficient, and took extra time to ensure the furniture was installed, tested (all power items), and placed where we wanted.  Dave asked me if I would not mind speaking with his manager after they were done and I said not at all.  Dave called his manager and I gladly assured him that the furniture had been delivered as promised and we were satisfied with the service we received.All-in-all, I would say my husband and I are very happy with our purchase, as well as the way Kyle, Dave, and Nick went above and beyond to help ensure the delay caused by the miscommunication issue was resolved as quickly as possible.  We will definitely do business with Mathis Brothers in the future for additional furniture needs.  I only gave 4 stars instead of 5 due to the initial issues, but that is no reflection on the service we received from Kyle, Dave, and Nick!"},{"reviewer_name":"Jay W.","rating":2,"date":"2014-12-14","comment":"We came in looking for a new sofa. We normally detest the hounding by the salespeople here but Jimmie Lee was helpful and we had a lot of fun with him. We wound up not only getting a new sectional sofa for the living room, but also a new sofa for the game room. We also bought the furniture protection plan for $290 and that's where the problems started. With the plan, we wound up dropping over $4,000. Okay. However, they used the $290 for the protection plan to add onto our already established $170 delivery fee for the furniture (which is 5% of the total purchase price for the furniture we bought). When we disputed the extra charge (it was only $14, but it was more principle than anything else after spending over 4 grand), the Cashier Manager \"Josh' copped an attitude and apparently didn't like me stating that I disagreed with the policy. His argument was that the protection plan was a service AND a product, therefore justifying adding it as part of the delivery fee. I wasn't having it and his response was, \"I can play this game all day long with you.\" 20 years ago, before having a family and a good job and not caring if I went to jail, I would have layed him out cold on the floor. What a punk. An employee of a supposedly large, reputable company should NEVER talk to a customer like that, especially a manager and especially to a customer that just spent a nice chunk of their hard-earned money. I hope this guy gets a nice reprimand. I will make sure to call management once our furniture is delivered and everything is in good order. This guy turned what was, up to that point, a very pleasant experience into one that left a bad taste in our mouths. Like most people, I like to be kissed when I'm being ****ed.***Follow-up: In response to Rick's comments below, I have suggested to Rick in a message that if he is sincere about his corporate babble below, to have Josh call me and personally apologize to me for his behavior. Should he do so appropriately. I will acknowledge his efforts in another follow-up. My guess is, Josh has the freedom to act with complete autonomy with no fear of reprisal which explains why he feels that he can talk to customers in the manner in which he did with me. Step up to the plate Rick and prove that you mean what you say. Put those \"core values\" to work and act on them. Otherwise Rick, your words fall on deaf ears."},{"reviewer_name":"Jb T.","rating":1,"date":"2015-10-06","comment":"I have always thought for quite sometime that Mathis Bros. had the greasy, used car approach.  Now I am sure of it.  I would not recommend Mathis Bros. to anyone.  Simply are a company that apparently operates without worry about integrity.My wife and I picked out a decent quality couch for the comfy room.  While I have no complaints about the service, the receipt and delivery was so pathetic to be comical.  I should just simply tell them to come pick it up and go elsewhere if time permitted.The couch had no protection, was dragged upon one end to the end of the truck, then brought in at their insistence the way they wanted to bring it in - not my preference.  Now in fairness, they got the couch into the house without damage as I held my breath.  And I was not going to argue with three large men as I stood by myself in my family room.However, the entire delivery was rushed, I was given little or no chance to inspect the furniture on site with the promise, \"hey, you got seven days to inspect it.\"  Yeah.  And I got to pull the entire couch out from the wall myself after they departed.  The couch itself does not feel nearly as solid as the store model making me suspicious how the couch was handled from start to finish.To make matters worse, and the reason for me taking the time to voice my complaint here, the customer service rep for delivery, was unhelpful, short, and frankly enabling how I might have had a much better service with their contracted help had I happened to get another one of their 13 trucks.  Well, maybe so.  But I didn't get another one of their 13 trucks.What she wanted to excuse was Mathis Bros. from having any responsibility upon leaving the store.  Sorry, sweetheart.  That's not how good businesses run."},{"reviewer_name":"Christina F.","rating":5,"date":"2016-07-23","comment":"Clayton Hale always does his best to help us at Mathis. I'm very picky, like to take my time and think about what I want and look around. He gives me my space, but when I need his help, he is always patient and directs me, measures things over and over, looks things up, etc. Thank you Clayton and Mathis for a great experience and great products!"},{"reviewer_name":"Christina S.","rating":5,"date":"2016-11-05","comment":"My roommate and I were having a very difficult time making a decision on a couch We have 0% interior decorating talent. Our living room was a mess, with mix matched furniture found on the curbside and random garage sales. Needless to say it was difficult for us to make a decision as we were walking through Mathis brothers. Brandyn saw our distress and saved us. We were able to schedule a time with him and brought him pictures of our living room. He has really good eye for color and has good spatial reasoning skills. Also he is an overall really nice and engaging person. With our bad pictures with our phone he suggested a sofa that was in our price range and would compliment the furniture that we already had. We trusted him, and we are so glad that we did. When we brought the couch to our home, it looked so good. A huge thanks to Brandyn for his outstanding service and guidance. Definitely look him up if you need help."},{"reviewer_name":"Gara F.","rating":1,"date":"2017-06-06","comment":"My aunt and uncle purchased a leather living room suite. The leather started to fade. They made several complaints about it was but was told by staff members that they haven't had any other complaints. My uncle went to the flawed/irregular depths and found 3 recliners that had faded just like his. They purchased a 2nd leather suite and had issues with the recliner. The store came out at least 4xs to repair it with parts that belonged to a whole different chair! When my family requested a new chair, the manager yelled at my aunt and told her that the he wasn't going to do anything for her because he said she had a bad attitude. He would had been upset too after 4 months of goofs! So, the store came and picked up the bad recliner and returned several weeks later with a \"new\" recliner. The store's \"new\" recliner was the old one!!! Unbelievable!!!! Horrible and nasty staff led by a horrifically rude office manager. What horrible and unprofessional service! Uncouth and dishonest practices!!! Reporting them to the BBB"},{"reviewer_name":"Robin D.","rating":4,"date":"2015-10-21","comment":"We had a chair with leather that was discoloring and Mathis Bros made it right."},{"reviewer_name":"Janet T.","rating":3,"date":"2016-07-27","comment":"The only reason why I gave it three is the selection. When I had my furniture delivered I thought they were supposed to attach the mirror to the dresser, but the delivery men made quite an ordeal over me asking them if they were supposed to attach it, so needless to say I tipped them each $20 and they did attach the mirror to the dresser on the bedroom suit that I bought.....my salesman was terrible..... He kept looking at his watch and checking his watch and I asked him if he needed to be somewhere or if he was running late that I could come back another time or have a different salesman, but he said no but he also continued the behavior.....I may have understood it wrong but the furniture protection plan that was around $200 I was told that the delivery Man would open it and put it on my furniture at the time of delivery .....I mentioned it to them several times, I was in the living room and they were setting up the bedroom suit when they left it was still in the box unopened and I would not of paid $200 to apply something myself!"},{"reviewer_name":"Ron W.","rating":1,"date":"2019-02-14","comment":"I bought a recliner from Mathis Brothers. When it came time to pay, the salesperson said that the transaction did not go through after he swiped my card. I showed him where it had already posted to my account, but he was insistent that he run the transaction again. I then showed him that there were now two charges to my credit card. He said it would be reconciled and I would not be charged twice. A week later, I still have two $500 charges posted on my card. I make a phone call and I am asked to provide proof that the charges were on my card. I asked if they could just look at the records and see that they had charged me twice. They said they could not, so I complied with the request for my records. I was told someone would contact me the next day. No phone call. Two days later, I emailed Mathis Brothers with no response. I then visit Mathis Brothers to get a refund. They said it had already been refunded and would post to my account within 4 business days. I asked why no one called me to tell me this and the supervisor curtly told me I should have just called. Nice customer service! I did \"just call\", and also emailed and got no response. I don't appreciate having to correct their billing mistake, and then them acting like a simple phone call would have fixed this whole issue.  Mathis Brothers needs to work on their customer service and communication skills."},{"reviewer_name":"Rebecca M.","rating":1,"date":"2016-06-30","comment":"If i could give them zero stars, I would. Never. Shop. Here. Ever.After looking at mattresses, we settled on one and paid for the mattress, delivery and encasement. The day of delivery, my husband worked at home in order to be available. He was sent an email saying delivery would be before noon, from 10am to 12 pm. No show, no call, no email. At 2 pm he called Mathis, was told delivery would be 4-6 pm. 7 o'clock rolled around and still no delivery. Called again, delivery showed up at almost 8 pm. Now the real fun - Mathis was to deliver and assemble bed frame, move master bedroom mattress to bed frame in guest room (which was already prepared), ENCASE new mattress and place in master bedroom. Not hard, especially since my husband was there to walk them through everything. Apparently too hard for Mathis. They left with part of the bed frame unassembled, the mattress not encased (which meant it voided the warranty, AND I would have to wrestle this behemoth in order to encase it myself.)When I went to the store the next day to address these issues, I was treated rudely and dismissively, Our next major furniture purchase too place elsewhere and I'm so glad it did.Never again, Mathis Brothers."},{"reviewer_name":"Kathy C.","rating":5,"date":"2017-10-10","comment":"Great products, very helpful sales people! Fast and professional delivery! It is my go to store for all of my furniture!"},{"reviewer_name":"Carole M.","rating":5,"date":"2017-06-22","comment":"Johnny and Larry with Abp delivery did a fantastic job, very patient and careful with our chair."},{"reviewer_name":"Charlotte H.","rating":5,"date":"2017-04-22","comment":"Shane Jobe was super helpful.  I am very happy with Mathis Brothers customer service."},{"reviewer_name":"Beverley B.","rating":4,"date":"2017-02-23","comment":"I just purchased some furniture from Mathis furniture in Tulsa, OK. I was very happy with our salesman. The delivery was right on schedule. The delivery men were very pleasant and friendly. I would recommend this store and the people who work there."},{"reviewer_name":"Randy N D.","rating":1,"date":"2017-11-26","comment":"If you will look up certain furniture pieces on their website, you find that you cannot locate that particular piece of furniture anywhere else on line. That is because they give the furniture a new name, one different from what the company that makes the furniture calls it. For instance, MB calls an end table that is made by the Sauder company, Verdant Valley, but Sauder calls that same table by a different name.   We found out the table we purchased from MB's website can be found on Amazon for $100 less because it is being sold under the name Sauder gave it and not under the new name that MB has changed it too. You cannot find a Verdant Valley end table except on MB's website and it cost us more. When we tried to get them to refund us the difference or pricematch all we got was the run around and \"I will call you right back\" from Ricky.  He never has. To us it seems like false advertisement and it is deceitful at best in our minds."},{"reviewer_name":"Zachary W.","rating":1,"date":"2015-08-19","comment":"0 stars.  Terrible customer service.  Bought a chair a month ago that was damaged upon delivery.  Item was set to be exchanged with in a week, but \"new\" chair was in worse shape then the original one, with a nail sticking out of the back and fabric being extremely loose.  Were supposed to have someone contact me last week about furniture services coming out, no call except 15 minutes before they were to arrive at my house this week. Someone from furniture services was supposed to call me back, but never did, prompting me to call them again, only to be told they'd call me.  Which they finally did, but then scheduled service a week from now, saying that it was my fault that I didn't tell them my availability, which was untrue.  Another call to customer service to get things correct, where again I was told I would be called back today, which of course didn't happen.  So I had to call in another time, spoke with a manager, who gave me the run around and said everything will be taken care of this Sunday.  I remain doubtful."},{"reviewer_name":"Lynn W.","rating":5,"date":"2016-10-26","comment":"Thank you for the sale and delivery of my new bedroom furniture. Brayden was the most helpful and friendly sales person. Overall great experience"},{"reviewer_name":"David A.","rating":3,"date":"2013-06-12","comment":"Nice selection of furniture, easy to browse.  The down-side?  The staff walking around like Sims with their notebook in hand, following the aisles, aimlessly wandering.  There's about a hundred of them.  It's quite off-putting.  Not that they hounded us, but we couldn't turn around without bumping into one of them.  At least there is plenty of help should you need it."},{"reviewer_name":"Elaine H.","rating":3,"date":"2015-11-26","comment":"My husband and I had purchased a 60\" TV console here with the understanding that this size came with optional wood doors besides the glass doors it originally comes with. After it was delivered, we found out it did not come with the wood doors as we were told in the store that it did and even the online website description said it came with 4 doors.  To our dismay, we ended up sending it back because we did not want the glass doors.  Customer service and our salesman Larry Basey were very considerate in refunding our money for the full amount and not charging us a restocking fee or delivery & pick up fee. Even though the console turned out not be what we wanted, we feel our salesman and customer service gave us a fair deal."},{"reviewer_name":"Katharine S.","rating":4,"date":"2011-01-28","comment":"Can't beat quality or pricing but the delivery and customer service was obnoxious, rude, and unprofessional. Long story short, I got delivery free and deposit refunded after spending $5000 there."},{"reviewer_name":"Patty M.","rating":5,"date":"2016-07-26","comment":"Well, I have to tell you, I never thought I would be giving Mathis a good rating as I have always felt like I was being stalked by many Salesmen the minute I walked through the door, and I hated the experience. One would feel like they needed to keep their hands in their pockets for fear that the guard was there to be sure you did not take something!  As for the Customer Service, there was no Customer Service, it was Customer, NO, SO SORRY!   Well, on a whim, I just decided to stop by to discuss a problem I was having with a Mattress I had purchased in November.  When I entered the store, I always try and run as fast as I can (I am 72) past the front desk to see if I can beat the next salesmen in line to get to where I want to go before he can catch up with me. In this case, it was to the Customer Service area (there actually was one).  Oh, my gosh, they talked to me, they listened to me, and they fixed my problem!  I was overwhelmed to say the least, and for the first time in my life, \"speechless\"!  I continued on through the store by myself after that while talking to my husband on the phone. I was so shocked at how the store was beautifully staged and arranged throughout,  definitely \"KUDOS\" to whoever is responsible for their staging and decorating!At this point, I am sure I have stepped into another store other than Mathis Brothers.  During my journey, by myself I an pleased to add, I came across a salesman by the name of \"Jorge\".  Jorge did not approach me, I approached him to ask him a question.  Again, \"Shock set in\".  Jorge may be one of the nicest and most professional sales people I have ever encountered in any furniture store.  Well, I don't know who is responsible for making my trip so pleasant from what it has ever been before, but \"Thank You\", for your creativity and awareness in trying to make this store a more pleasant place in which to view and purchase furniture.  I can only hope that this was not a fluke event, but a sign that Mathis is really trying to make their store a much more friendly place to come and enjoy what is really the only game in town!"},{"reviewer_name":"Dana M.","rating":4,"date":"2016-05-26","comment":"If I was rating the customer service manager I would have given no stars. He (James S.) is an arrogant jerk with a huge chip on his shoulder. My husband and I have furnished our home with Mathis Brothers furniture. Over the years we have spent a lot of money in the store. After dealing with James S. I was ready to forget that Mathis Brothers exists and find another place to buy our furniture. James S. was fine with that. Is that good Customer Service? If it wasn't for our wonderful salesman Jeff F. who really was an absolute pleasure to work with and worked hard at keeping our business we would have never shopped there again. I would have given 5 stars if I was rating Jeff, Charles King ( who had to come in to smooth over James's interference) and even the delivery people were great. Jeff F has wonderful customer service. I think he would be a much better fit for James's job. I believe James S. would benefit with a little Undercover Boss. He definitely needs to be canned or have further training. I dealt with him one other time also. I believe it was right after he started there and that was a bad experience also. Luckily I happened to call on his day off and got a woman who was awesome to correct his mistakes. My furniture was delivered yesterday and I love it! Thank you Jeff F.! You went above and beyond to make things right. I hope you are appreciated there!"},{"reviewer_name":"Rachel D.","rating":5,"date":"2016-03-18","comment":"Let me start by saying I have never been a fan of Mathis Brother. However; Clayton (sales rep) and Lisa (designer) have changed my mind! I cannot thank them enough for all of their help. This was the BEST experience I have had purchasing new furniture. I am extremely picky and a bit indecisive. They were so patient, and really got to know my style. Also, their customer service and attention to detail cannot be matched. If you are looking for new furniture, call Clayton! I promise you will not be disappointed."},{"reviewer_name":"Matthew C.","rating":1,"date":"2010-12-20","comment":"Buyer Beware!  While I have made several purchases from Mathis Brothers, my most recent will be my last.  They have excellent prices, but their sales practices are clearly anti-customer.  The sales staff hover unmercilessly.  Several questions I had while in the showroom were either unanswered or clearly incorrect.  The piece I received was damaged out of the box and the customer service has been terrible.  Their interest in you clearly wanes as soon as you hand over your money.  While you might pay more somewhere else, it will be in your best interest to do so."},{"reviewer_name":"David R.","rating":1,"date":"2012-10-20","comment":"We purchased over $5000 worth of furniture from Rooms Today in Tulsa in Oct of 2012. We had a wonderful experience with our salesman during the buying time. The issues we have is with the delivery drivers and quality of product being provided by the store. Our 1st purchase only had one issue with a dented end table, it took two different replacement table before we received an acceptable product. Next we purchased a third end table and chase lounger. They were delivered without issues. The last round of purchase was a dining room set with matching buffet and hutch. Its now been three weeks and we have relieved two different buffets and china hutch and we're on our third table. At this point we are having issues with our salesman, and customer service responding to our request. I just called the store manager and left a message and he did call me back. He explained to me that all his product is shipped from china and if we expect perfect furniture delivered, then that wasn't going to happen. The last delivery still had issues on the table and the china hutch had marks and raw wood showing on the doors. The bottom section has three draws that one of them was manufactured in a different design and sticks out 1/2\" from the other two when it is closed. The store manager did agree to let us bring the items back and return the product and he would give us 10% off the price of the items to apply to a new set if we like. This would amount to about a $200 discount. He said that's the best he could do, now the customer service department has already offered us $300 off just to accept the damaged product and just settle the problem. Also beware if you live in the south Tulsa or Jenks area, their delivery guys also have issues they need to deal with. One of the delivery guy was very nice and polite about the issues we found, the other was rude and made comments about we're just to picky and we just need to get over it and accept this for what it is. He even pulled a marker out to cover up a deep scratch in the product. So don't let your wife handle this by yourself unless you want to listen to her complain about how they treat you for the next week or so. Stay tune, at this point the store manager is going to send out another set of china/buffet cabinet and see if we would be satisfied with it. but we're stuck with the delivery drivers, its the only ones they have for this side of town. I told him that was fine, but the one guy better keep his mouth shut and not make a single comment during the delivery."},{"reviewer_name":"Sarah B.","rating":3,"date":"2014-11-16","comment":"So excited to be out shopping for a new mattress!  Getting married soon so today we decided to brave the snow and sleet and make a purchase. We currently have a Lady Americana bed and love it. We are a budget as we are getting married in 2 weeks!  We walked in... With money in hand (remember I said budget) ready to make a purchase!  The first sales guy that approached us was JR.  We told him what we were there for, told him what we currently had and that I really liked it, but was open to any suggestions he had. His first words were as follows \"you have a Lady Americana now? Oh those are trash mattresses.  I wouldn't dare sleep on one of those. If you're looking for a bottom of the barrel kinda mattress that's what that brand is\"..... I paused... thinking wow you're totally misrepresenting your company right now.... and calling me cheap with no taste at all. He was very rude and set the tone for the day. I took a second to clear my head as to not say anything rude.... and my fiancé and I walked away. I then found another associate, John. Told him what we were there for... Our expectations of a mattress and our budget.  He was super friendly and very helpful!  We made our purchase and couldn't be more excited!  Thanks John. You turned a horrible experience into a great one!! Cheers to sleeping on our new bed tonight! !"},{"reviewer_name":"Vickia F.","rating":1,"date":"2015-10-22","comment":"I am a regular customer of Mathis Brothers.  All of my furniture was purchased from there. Recently, I bought a house, so I bought over $10,000 of furniture yesterday (bedroom and dining room only)....CASH! I was sooo excited until I was told that the shipping was OVER $500.  What?!?!? Mouth hit the floor!  I would think that they would be able to work something out with me on the delivery considering the fact that I just spent such a huge amount of money with them (at least split the delivery with me). Many places offer free delivery with a minimum purchase.  As big as Mathis Brothers is in Tulsa, they should be able to do the same. I still have a lot more furniture to buy for my new house.  I WILL be going elsewhere to shop from now on.  Really considering canceling my current purchase too. How disappointing!! ;("},{"reviewer_name":"Billy B.","rating":2,"date":"2014-06-09","comment":"My wife and I went to the Mathis Bros. in Tulsa on a Sunday rainy afternoon to look for some liv. chairs and as we walked in, it was like being thrown into lion's den, there must have been 20 sales people attacking us. We told them we were just looking around to get some idea's of what we wanted. They asked if we wanted a (LEAVE ME ALONE) sticker to wear. I know times are a little tuff,,,,,,,,but come on.We felt like we were being stalked all through the store, and we must have said at least half a dozen times,(just Looking Thanks).Un Happy  shoppingBilly B."},{"reviewer_name":"Nancy R.","rating":3,"date":"2013-09-30","comment":"I was not blown away. These store has a nice selection but they have too many sales people. Its like walking around a used car lot. How many times to I have to say \"Let us browse around and I will call you if I need you? \""},{"reviewer_name":"Jill T.","rating":4,"date":"2015-11-24","comment":"Between the Mathis Brothers and Ashley Furnture store (owned by Mathis) I purchased a queen sized bed, queen mattress, couch, loveseat, coffee table, side table, dining room table and two accent chairs.  I paid less than $4000 for everything including delivery.I worked with the same two salesman who were very pleasant and knew to leave me be since I like to roam.  I checked in with the front desk when I visited Mathis so I could get my VIP sticker and not be harassed.  Thank god they do that because there are so many salespeople!  The transaction was easy, I purchased everything that was a stock color or item, and the deliveries coincided for exactly the same day and time.  Since they are related stores the same group of delivery guys and truck were used.  The delivery guys assembled the bed too!  They were very fast.I waited just one week and it was all here on time.I am very pleased with the service for a furniture store.Only one point was taken off because they didn't have a lot of furniture to my style (mid century/ modern), the delivery guys removed the plastic on the bed which I didn't realize would affect the return policy if I wanted to, and the bed wasn't as comfortable as in the store.  It's a pillow top but felt much stiffer than I remembered... I'd just say be wary of the mattresses while you're shopping and do your homework.  My bf says the bed is soft but I'll be sticking it in the guest room anyhow.  Overall very happy considering how most furniture companies stick it to you.  I ordered the rest of my furniture from wayfair.com since they have a wide variety of modern items.  Jeff G. at Mathis was great.  PS this isn't my first review I just can't remember my other yelp login..."},{"reviewer_name":"Steve S.","rating":2,"date":"2017-09-04","comment":"We came to Mathis Brothers June 30, 2017 and purchased quality mattress and frame that adjusts with remote to raise and lower the head or feet. We spent 2500.00 dollars with warranty and such.  Delivery was on time with nice drivers who set up the bed.  After a month my wife thought the mattress looked crimped from be raised a few times and this was after lowering the head down.  I called the store in Tulsa, and was transferred to customer service.  This started a run around from Tulsa to OKC back to Tulsa where we purchased the set.  Then the guy had me call the company who make the frame, and I was told they make the frame not the mattress.  The Mathis team seemed kinda of rude trying to give me the brush off.  We were told by our salesman we would get a a 300.00 dollar gift card in a couple of weeks.  No gift card, no concern from the people I spoke to.  Poor customer service with our experience.  We won't deal with Mathis Brothers again."},{"reviewer_name":"Kathy W.","rating":1,"date":"2015-03-05","comment":"We loved visiting Mathis Brothers and after several trips to Tulsa, Joplin, andSpringfield we returned to MB to purchase around $4,500 worth of furniture.  We had a great salesperson (KATIE) and I told everyone about our experience; HOWEVER, the story changes.  We were moving to a new condo and our delivery was set up for one month later to be delivered from Tulsa to Springfield, MO.  The day before the scheduled delivery I called 3 times to check on the delivery.  When they arrived they only had my matress and box springs.  I called the store and they said it would be at least another 5-6 weeks before the remainder would be in stock and another week for delivery.  I inderstand mistakes but what really upsets me is that they had 3 opportunites to tell me i wasn;t getting my living room furniture.  When I called customer service, they pretty much said, tough luck.  It is what it is.  No apology,...what can I do to make it better.  And it gets worse.  I had paid $1500 down and financed same as cash on the rest of the order.  When I told them I wanted my money refunded, again, tough luck, they would apply it to my financing.  As I had planned a birthday party for the next day, I had to go out and purchase more furniture in one day as the party was the next day.  Love the store, but you cannot believe a word they say so I don';t know why I would actually believe what they told me about anything, warranties, delivery, etc. If they had offered some apology about my predictament, I might feel differently.  But, I think they're too big and don't need to worry about customers.  I'd really like to meet with the owner, Rit, etc. but I couldn't find any way to reach them."},{"reviewer_name":"Melissa M.","rating":2,"date":"2015-05-25","comment":"Bought Bernhardt leather furniture in 2008. Bought the furniture protection plan which when purchased we were told it would cover a wide range of reasons. (Including dog)Our furniture had some frame problems on the arm of the chair. Had MB come out to inspect it.  We were told because we have a dog and there were scratches on the furniture that our protection plan was void...EVEN though the scratches were not caused by a dog, but by the metal on the pockets of jeans.   Finding out this many years later, MB should have contacted or had us contact Bernhardt for the frame damage.  We took our chance and bought more furniture in January of 2014.  We purchased the Johnathon Louis sectional.  We have had to have MB come out repeatedly to clean the sectional.  We even had the covers replaced however the fabric has a whole different feel on the spots that were \"cleaned.  Also the back cushions have lost their shape,and droop. We are not hard on our furniture at all, so to have this happen is frustrating.  VERY UNHAPPY with this furniture.   I called MB director Cody Wright and left a message to see about returning this furniture on Monday May 18, 2015 and have yet to hear back from him!!!"},{"reviewer_name":"Allison M.","rating":4,"date":"2016-06-18","comment":"I purchased a sofa and recliner from this Mathis Brothers store last month. As some other reviews say, your experience totally depends on the salesperson you work with. I went in twice before making my purchase and the first two salespeople were subpar. One seemed to know nothing about the furniture, the second just let me wander around by myself and seemed annoyed when I asked her questions, like the dimensions of a particular piece. On my third visit, I had a sofa in mind that I was going to buy and was shown around by a salesman named Jorge. He was great - super nice, answered all my questions and concerns. After deciding on the sofa and picking out the recliner as an impulse buy, Jorge arranged the delivery, even asking his manager to make an exception so that I could get my furniture the day I needed it. I shopped at several other stores and Jorge was by far the most competent, customer-oriented salesperson I encountered. I will definitely try to buy from him in the future."},{"reviewer_name":"Jana S.","rating":5,"date":"2009-09-17","comment":"I really, really love Mathis Brothers.  I have found some of the absolute best buys here.  In 2000, I purchased a beautiful hand painted mahogany armour.  It was a furniture show sample (one of a kind).  I paid $1999 when it would have retailed for well over $9000.  Any time I am in Tulsa, I stop by to browse their one of a kind and sample items from Ralph Lauren, Henredon, Baker, etc.  You can find some of the best deals, high end furniture at Rooms 2 Go pricing."},{"reviewer_name":"Carrie H.","rating":1,"date":"2015-03-23","comment":"I recently purchased a couch from Mathis Brothers.  Although our Sales person was outstanding the delivery of the couch was an absolute mess.  I received an email stating the couch we be delivered between 2:17-4:17pm.  I received that email the day prior to the delivery so I made arrangements for my mother to be there to accept the delivery since I had to work.  The day of the delivery I receive a call from the driver stating they will be there between 4:15-6:15pm.  I tell him that I received an email stating they would arrive between 2:17-4:17pm and that I had made arrangements for someone to be there during those times.  He really didn't seem to care and didn't have much to say.  I called my mother and made arrangements for her to be there during the times the delivery driver told  me he would be there.  At 6pm I called the store to check on the status of the delivery.  (Both my mother and I had plans for the evening).  I was told by customer service it would be no later than 6:45pm.  I postponed my plans and at 6:45 they were still not there.  My mother cancelled her plans and at 8pm, when they were still not there, she called the store again.  She was told that it could as late as 10pm before the couch was delivered.  The couch was delivered at 8:30pm.  I was completely dumbfounded at the fact that they absolutely did not care that they inconvenienced myself or my family.  Apparently there is not rhyme or reason to the way they schedule their deliveries.  I would rather rent two men and a truck to go pickup my furniture and delivery to the house than ever use Mathis Brothers Delivery again."},{"reviewer_name":"Lisa M.","rating":2,"date":"2012-09-09","comment":"Our original delivery time was 9-11am, no show, rescheduled for 3-5pm still late, hope my next delivery next week is on time"},{"reviewer_name":"Jerry B.","rating":2,"date":"2016-09-07","comment":"I went to Mathis Brothers today wanting to purchase two recliners. I had heard that the sales people are like some buzzards waiting for some one to come into view so they can start buzzing. This place is a lot worse than that. They line up in a gauntlet when you first enter the store and you feel like you fell into the lions cage at the zoo wearing a meat suit. The lion that attacked me was \"Donny\". I told him that I was going to look around and was okay right now. He kept right on talking and asking me questions. After almost cussing I told him to get away and leave me alone. Alas, he kept right on talking and following me around. I have never witnessed such a salesperson. They must really be poorly paid to have to act like this. I left and went down the street to Sunshine and bought the chairs with no hassle and no stalking. Would never go in to Mathis Bros again and will make sure to spread the word."},{"reviewer_name":"Chris W.","rating":3,"date":"2013-12-01","comment":"I have purchased two sofas from them, each time it was a delivery nightmare.  Even though I have found the purchasing experience smooth. Im very hesitant to purchase from them again due to the inevitable delivery problems and dealing with their severely rude customer service."},{"reviewer_name":"Rosa W.","rating":1,"date":"2016-09-25","comment":"My husband and I went in to buy a new bedroom set and mattress. Love the bedroom set. We bought a mattress and the salesman says don't wait too long hating it if you don't like it bring it back. They have a sleep comfort policy. We paid $2000 for this foam/gel mattress. The one we tried at the showroom was so soft and comfortable. When we got the mattress it felt like a hard block of styrofoam !! I have had several surgeries on my back and each and every day I get out of bed I hurt from head to toe! I went back to pick out another mattress and was told \" it's like a pair of shoes you have to break it in\" they refused to take it back because I hadn't \"turned \" the mattress.  I read everything about the mattress and it didn't say it needed to be turned . By the time I turn it as much as they say my sleep comfort guarantee will be over and I'll be stuck with a mattress that just kills me! My name is Rosa Whisman and I purchased the pain in my back at the Tulsa store. Mr. Stroud was my salesman, he was great and tried to help me it was customer service who says I have to turn it a few times!"},{"reviewer_name":"Joe B.","rating":1,"date":"2016-06-03","comment":"this is my second review of mathis brothers in tulsa, see joe b. in claremore 5/23/16. after returning the damaged tv stand, customer service told my wife they would credit our credit card and it would take 5 to 7 days. on 3 june, 11 days later, our account had still not been credited. called customer service and was transferred to a cashier. she looked it up and said she saw where it was returned, but they still had the money. she wanted to know if my wife swiped her card when she returned it, i said i didn't know. she said we had to swipe the card to get the refund, but she'd do it over the phone. why didn't they have her swipe the card when she returned it if that's what it takes. also the order was placed and paid for online, they still had the credit card #. she said i should see the credit in 2 to 5 days, we will wait and see."},{"reviewer_name":"Audrey D.","rating":1,"date":"2014-08-14","comment":"I purchased a very expensive sectional couch, which after a few months started to sag & I mean sag. You couldn't even fluff up the pillows to look normal. I contacted Mathis and they told me I had to give them a chance to fix the problem. Mathis came out and inspected the couch, then contacted the rep for the manufacturer. They told me the pillows were defective and they would replace them with correct pillows. I said  \"what happens if it does this again\". Mathis told me no problem they would give me store credit. Well guess what...after a few months the couch did it again. So I called. Mathis tells me they need to replace the pillows again as they ordered the defective ones again. REALLY..... I was not happy. They will do nothing to fix this problem, but keep stuffing the pillows. They are not even nice about it. They should stand by their products."},{"reviewer_name":"Bob B.","rating":1,"date":"2013-08-10","comment":"DO NOT buy a mattress from this organization, ESPECIALLY  A LADY AMERICANA. DO NOT BUY FROM THEM,, DO NOT PAY THE MONEY FOR THEIR MATTRESS PAD, LADY AMERICANA IS THEIR BRAND AND IT IS A RIP OFF. GO SOMEWHERE ELSE. We just receiving our THIRD Warranty replacement. Our Bedroom was torn apart and ready for the NEXT new mattress. There was a small stain on the foot of the bed and they put the new mattress back on the truck. This was a $2500.00 dollar mattress and it lasted a year. The first one lasted 1.5 years. We were told to call their cleaning service which we did, They are not open until Monday (this is Saturday). We paid an ungodly amount for their mattress pad which was sold to us as being impermeable and the only way we could maintain the warranty.  It was faulty and the mattress stained anyway. I asked for them to leave the new mattress and we would get the old one cleaned Monday. This they would not do. We want our bedroom back TODAY. The stain happened because THIER mattress pad did not do what THEY said it was for. DO NOT BUY FROM THEM,, DO NOT PAY THE MONEY FOR THEIR MATTRESS PAD, LADY AMERICANA IS THEIR BRAND AND IT IS A RIP OFF. GO SOMEWHERE ELSE."},{"reviewer_name":"Sherry H.","rating":1,"date":"2013-07-18","comment":"Not impressed at all with the staff.  I needed two living room sets and a bedroom set, the associate pointed me in the direction of the bedroom sets I inquired about, and then told me she'd check on me later.  I was still waiting after 20 minutes.  They all cruise the store looking for as many customers as possible, and when you do run into another one, they text the first one you were working with.  Totally horrible experience, very disappointed.  Total expenditure at another furniture store was about $10,000, so I guess they missed out."},{"reviewer_name":"B B.","rating":2,"date":"2014-03-17","comment":"Way to many pushy sales people, furniture is ok but over priced. If you just want to look tell them you are already working with another sales person when they grab you at the door. I've purchased more than $2000 in furniture here and would return but never for casual shopping because of the aggressive sales people"},{"reviewer_name":"Lisa S.","rating":2,"date":"2015-07-01","comment":"My husband and I are long-time customers of Mathis Brothers.  You cannot beat the selection and prices that they have.  Unfortunately, their customer service is terrible.  I have purchased at least 20 items from Mathis Brothers in the past 20 years and can think of one time that the delivery went smoothly.  The customer service people are friendly, but cannot give you any useful information. You are on your own after you buy something and if something goes wrong (i.e., furniture is damaged upon delivery, wrong furniture delivered, not all of the order delivered, etc.) then you are on your own to figure out how to correct it.  You will spend hours trying to track down correct information.  Each department does not communicate with the other department- it is maddening. You will get a different story depending on who you talk to.  One recent example, I called customer service to ask how to replace or repair a chair that was still under manufacturer's warranty and was told that if I could bring the chair during a weekday between 1-4pm that someone would look at it and determine whether it could be repaired or needed to replaced.  When I showed up, less than an hour after the phone call at 1:40 pm, I was told that it was only the upholstery repair people that were there at that time and I would have to leave the chair.  I was told that I would hear something back in 3-4 business days. Five business days passed and I called and was told no one had looked at it yet and that it would be at least 7 business days before I heard anything.  If there was any other option that had close to the selection that MB has near OKC  then I would happily shop there."},{"reviewer_name":"Lulu N.","rating":2,"date":"2013-08-26","comment":"Great choice in furniture and decent pricing. The store would be great if it wasn't for the creepy sales staff. From the assault at the front door to them stalking you throughout your browsing experience, I'm totally turned off by this sales strategy. Tonight, the sales guy would just show up out of nowhere every ten minutes and when we finally landed in rugs to do some browsing, our appointed sales person sat on a pile of rugs, watching and listening to my husband and I discuss the different rugs, chiming in during our discussion. Creepy and invasive. For this very reason, I won't return."},{"reviewer_name":"Brittani C.","rating":1,"date":"2011-01-06","comment":"We had a defective mattress from one of MBF's stores, Rooms Today. Customer service directed us to Mathis Brothers and we began dealing with them. We were met with extreme hostility at all steps when trying to resolve the issue. A representative from the company came to our home and acknowledged that the mattress in question was indeed defective. We were advised to go to Mathis Brothers to choose a replacement mattress, as we were under warranty. We went to MB and found the mattress that the salesperson stated was \"identical\" to the one we already had (it was the new model, but 3 salespersons have told us they are the exact same mattress, including the woman we originally bought it from, which is why we bought it). We then came back the next day to meet with the customer service department to complete the exchange details. The customer service representative (Joe) greeted us impolitely and did not get up from his desk to acknowledge us. We were told that we would have to pay $60 for the company to come pick up our DEFECTIVE mattress and bring our new mattress. We then were told that we would only receive store credit, which would not allow us to replace the mattress with one of equal quality because the price had gone up 30% in the FOUR months since we purchased the defective mattress. We were also told that we could not be refunded our money. Because we could not believe that we were being asked to pay $360+ just because we had a defective product, we asked to speak to the manager (Tom), who met us at customer service. Tom approached us with a very combative attitude from the beginning and never showed any sign of listening to what we had to say. I cannot put into words (at least in polite company) how unthinkably offensive and disrespectful Tom acted toward us. We explained to him that there was a difference in returning the product (and getting store credit) versus having a warranty that should replace a defective product. He cut us off and said we would have to talk to another customer service person the following day (Justin Lewis). As he walked out the door, he stated, \"you didn't even buy the mattress at this store!\" While that is correct, the tone of the comment was that we were stupid and/or cheap. We had been told that if we had any issues with our mattress, we could return it and have it replaced with another just like it. This absolutely was not the case. The entire situation was clearly a bait-and-switch. We bought a defective product, we are not being given a replacement or one of equivalent quality, and are also not being given our money back."}]}